HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.h
extern volatile __DMTCLRbits_t DMTCLRbits ;//__asm__ ("DMTCLR") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DMTSTAT ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned WINOPN:1;
    unsigned :4;
    unsigned DMTEVENT:1;
    unsigned BAD:2;
  };
  struct {
    unsigned :6;
    unsigned BAD2:1;
    unsigned BAD1:1;
  };
  struct {
    unsigned w:32;
  };
} __DMTSTATbits_t;
extern volatile __DMTSTATbits_t DMTSTATbits ;//__asm__ ("DMTSTAT") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DMTCNT ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned COUNTER:32;
} __DMTCNTbits_t;
extern volatile __DMTCNTbits_t DMTCNTbits ;//__asm__ ("DMTCNT") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DMTPSCNT ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned PSCNT:32;
} __DMTPSCNTbits_t;
extern volatile __DMTPSCNTbits_t DMTPSCNTbits ;//__asm__ ("DMTPSCNT") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DMTPSINTV ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned PSINTV:32;
} __DMTPSINTVbits_t;
extern volatile __DMTPSINTVbits_t DMTPSINTVbits ;//__asm__ ("DMTPSINTV") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RTCCON ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned RTCOE:1;
    unsigned HALFSEC:1;
    unsigned RTCSYNC:1;
    unsigned RTCWREN:1;
    unsigned :2;
    unsigned RTCCLKON:1;
    unsigned RTCOUTSEL:2;
    unsigned RTCCLKSEL:2;
    unsigned :2;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
    unsigned CAL:10;
  };
  struct {
    unsigned w:32;
  };
} __RTCCONbits_t;
extern volatile __RTCCONbits_t RTCCONbits ;//__asm__ ("RTCCON") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RTCCONCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RTCCONSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RTCCONINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RTCALRM ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned ARPT:8;
    unsigned AMASK:4;
    unsigned ALRMSYNC:1;
    unsigned PIV:1;
    unsigned CHIME:1;
    unsigned ALRMEN:1;
  };
  struct {
    unsigned w:32;
  };
} __RTCALRMbits_t;
extern volatile __RTCALRMbits_t RTCALRMbits ;//__asm__ ("RTCALRM") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RTCALRMCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RTCALRMSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RTCALRMINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RTCTIME ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned :8;
    unsigned SEC01:4;
    unsigned SEC10:4;
    unsigned MIN01:4;
    unsigned MIN10:4;
    unsigned HR01:4;
    unsigned HR10:4;
  };
  struct {
    unsigned w:32;
  };
} __RTCTIMEbits_t;
extern volatile __RTCTIMEbits_t RTCTIMEbits ;//__asm__ ("RTCTIME") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RTCTIMECLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RTCTIMESET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RTCTIMEINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RTCDATE ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned WDAY01:4;
    unsigned :4;
    unsigned DAY01:4;
    unsigned DAY10:4;
    unsigned MONTH01:4;
    unsigned MONTH10:4;
    unsigned YEAR01:4;
    unsigned YEAR10:4;
  };
  struct {
    unsigned w:32;
  };
} __RTCDATEbits_t;
extern volatile __RTCDATEbits_t RTCDATEbits ;//__asm__ ("RTCDATE") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RTCDATECLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RTCDATESET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RTCDATEINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ALRMTIME ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned :8;
    unsigned SEC01:4;
    unsigned SEC10:4;
    unsigned MIN01:4;
    unsigned MIN10:4;
    unsigned HR01:4;
    unsigned HR10:4;
  };
  struct {
    unsigned w:32;
  };
} __ALRMTIMEbits_t;
extern volatile __ALRMTIMEbits_t ALRMTIMEbits ;//__asm__ ("ALRMTIME") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ALRMTIMECLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ALRMTIMESET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ALRMTIMEINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ALRMDATE ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned WDAY01:4;
    unsigned :4;
    unsigned DAY01:4;
    unsigned DAY10:4;
    unsigned MONTH01:4;
    unsigned MONTH10:4;
  };
  struct {
    unsigned w:32;
  };
} __ALRMDATEbits_t;
extern volatile __ALRMDATEbits_t ALRMDATEbits ;//__asm__ ("ALRMDATE") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ALRMDATECLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ALRMDATESET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ALRMDATEINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CVRCON ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CVR:4;
    unsigned CVRSS:1;
    unsigned CVRR:1;
    unsigned CVROE:1;
    unsigned :8;
    unsigned ON:1;
  };
  struct {
    unsigned CVR0:1;
    unsigned CVR1:1;
    unsigned CVR2:1;
    unsigned CVR3:1;
  };
  struct {
    unsigned w:32;
  };
} __CVRCONbits_t;
extern volatile __CVRCONbits_t CVRCONbits ;//__asm__ ("CVRCON") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CVRCONCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CVRCONSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CVRCONINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        _ICDCON ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CKSWBKEN:1;
  unsigned SLPBKEN:1;
  unsigned WDTBKEN:1;
  unsigned WDTEN:1;
  unsigned RSTBUG:1;
  unsigned DMTBKEN:1;
  unsigned DMTEN:1;
  unsigned :7;
  unsigned FRZ:1;
} ___ICDCONbits_t;
extern volatile ___ICDCONbits_t _ICDCONbits ;//__asm__ ("_ICDCON") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        _ICDSTAT ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CKSWBF:1;
  unsigned SLPBF:1;
  unsigned WDTBF:1;
  unsigned DMTBF:1;
} ___ICDSTATbits_t;
extern volatile ___ICDSTATbits_t _ICDSTATbits ;//__asm__ ("_ICDSTAT") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OSCCON ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned OSWEN:1;
  unsigned SOSCEN:1;
  unsigned :1;
  unsigned CF:1;
  unsigned SLPEN:1;
  unsigned :2;
  unsigned CLKLOCK:1;
  unsigned NOSC:3;
  unsigned :1;
  unsigned COSC:3;
  unsigned :6;
  unsigned SLP2SPD:1;
  unsigned :1;
  unsigned DRMEN:1;
  unsigned FRCDIV:3;
} __OSCCONbits_t;
extern volatile __OSCCONbits_t OSCCONbits ;//__asm__ ("OSCCON") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OSCCONCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OSCCONSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OSCCONINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OSCTUN ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned TUN:6;
} __OSCTUNbits_t;
