HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.h
extern volatile __OSCTUNbits_t OSCTUNbits ;//__asm__ ("OSCTUN") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OSCTUNCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OSCTUNSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OSCTUNINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SPLLCON ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned PLLRANGE:3;
  unsigned :4;
  unsigned PLLICLK:1;
  unsigned PLLIDIV:3;
  unsigned :5;
  unsigned PLLMULT:7;
  unsigned :1;
  unsigned PLLODIV:3;
} __SPLLCONbits_t;
extern volatile __SPLLCONbits_t SPLLCONbits ;//__asm__ ("SPLLCON") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SPLLCONCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SPLLCONSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SPLLCONINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RCON ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned POR:1;
  unsigned BOR:1;
  unsigned IDLE:1;
  unsigned SLEEP:1;
  unsigned WDTO:1;
  unsigned DMTO:1;
  unsigned SWR:1;
  unsigned EXTR:1;
  unsigned :1;
  unsigned CMR:1;
  unsigned :16;
  unsigned BCFGFAIL:1;
  unsigned BCFGERR:1;
} __RCONbits_t;
extern volatile __RCONbits_t RCONbits ;//__asm__ ("RCON") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RCONCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RCONSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RCONINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RSWRST ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned SWRST:1;
} __RSWRSTbits_t;
extern volatile __RSWRSTbits_t RSWRSTbits ;//__asm__ ("RSWRST") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RSWRSTCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RSWRSTSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RSWRSTINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RNMICON ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned NMICNT:16;
  unsigned WDTS:1;
  unsigned CF:1;
  unsigned :1;
  unsigned GNMI:1;
  unsigned :3;
  unsigned SWNMI:1;
  unsigned WDTO:1;
  unsigned DMTO:1;
} __RNMICONbits_t;
extern volatile __RNMICONbits_t RNMICONbits ;//__asm__ ("RNMICON") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RNMICONCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RNMICONSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RNMICONINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PWRCON ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned VREGS:1;
} __PWRCONbits_t;
extern volatile __PWRCONbits_t PWRCONbits ;//__asm__ ("PWRCON") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PWRCONCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PWRCONSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PWRCONINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        REFO1CON ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned ROSEL:4;
  unsigned :4;
  unsigned ACTIVE:1;
  unsigned DIVSWEN:1;
  unsigned :1;
  unsigned RSLP:1;
  unsigned OE:1;
  unsigned SIDL:1;
  unsigned :1;
  unsigned ON:1;
  unsigned RODIV:15;
} __REFO1CONbits_t;
extern volatile __REFO1CONbits_t REFO1CONbits ;//__asm__ ("REFO1CON") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        REFO1CONCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        REFO1CONSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        REFO1CONINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        REFO1TRIM ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :23;
  unsigned ROTRIM:9;
} __REFO1TRIMbits_t;
extern volatile __REFO1TRIMbits_t REFO1TRIMbits ;//__asm__ ("REFO1TRIM") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        REFO1TRIMCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        REFO1TRIMSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        REFO1TRIMINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        REFO2CON ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned ROSEL:4;
  unsigned :4;
  unsigned ACTIVE:1;
  unsigned DIVSWEN:1;
  unsigned :1;
  unsigned RSLP:1;
  unsigned OE:1;
  unsigned SIDL:1;
  unsigned :1;
  unsigned ON:1;
  unsigned RODIV:15;
} __REFO2CONbits_t;
extern volatile __REFO2CONbits_t REFO2CONbits ;//__asm__ ("REFO2CON") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        REFO2CONCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        REFO2CONSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        REFO2CONINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        REFO2TRIM ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :23;
  unsigned ROTRIM:9;
} __REFO2TRIMbits_t;
extern volatile __REFO2TRIMbits_t REFO2TRIMbits ;//__asm__ ("REFO2TRIM") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        REFO2TRIMCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        REFO2TRIMSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        REFO2TRIMINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        REFO3CON ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned ROSEL:4;
  unsigned :4;
  unsigned ACTIVE:1;
  unsigned DIVSWEN:1;
  unsigned :1;
  unsigned RSLP:1;
  unsigned OE:1;
  unsigned SIDL:1;
  unsigned :1;
  unsigned ON:1;
  unsigned RODIV:15;
} __REFO3CONbits_t;
