HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.h
extern volatile __REFO3CONbits_t REFO3CONbits ;//__asm__ ("REFO3CON") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        REFO3CONCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        REFO3CONSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        REFO3CONINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        REFO3TRIM ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :23;
  unsigned ROTRIM:9;
} __REFO3TRIMbits_t;
extern volatile __REFO3TRIMbits_t REFO3TRIMbits ;//__asm__ ("REFO3TRIM") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        REFO3TRIMCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        REFO3TRIMSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        REFO3TRIMINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        REFO4CON ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned ROSEL:4;
  unsigned :4;
  unsigned ACTIVE:1;
  unsigned DIVSWEN:1;
  unsigned :1;
  unsigned RSLP:1;
  unsigned OE:1;
  unsigned SIDL:1;
  unsigned :1;
  unsigned ON:1;
  unsigned RODIV:15;
} __REFO4CONbits_t;
extern volatile __REFO4CONbits_t REFO4CONbits ;//__asm__ ("REFO4CON") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        REFO4CONCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        REFO4CONSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        REFO4CONINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        REFO4TRIM ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :23;
  unsigned ROTRIM:9;
} __REFO4TRIMbits_t;
extern volatile __REFO4TRIMbits_t REFO4TRIMbits ;//__asm__ ("REFO4TRIM") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        REFO4TRIMCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        REFO4TRIMSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        REFO4TRIMINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PB1DIV ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned PBDIV:7;
  unsigned :4;
  unsigned PBDIVRDY:1;
} __PB1DIVbits_t;
extern volatile __PB1DIVbits_t PB1DIVbits ;//__asm__ ("PB1DIV") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PB1DIVCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PB1DIVSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PB1DIVINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PB2DIV ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned PBDIV:7;
  unsigned :4;
  unsigned PBDIVRDY:1;
  unsigned :3;
  unsigned ON:1;
} __PB2DIVbits_t;
extern volatile __PB2DIVbits_t PB2DIVbits ;//__asm__ ("PB2DIV") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PB2DIVCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PB2DIVSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PB2DIVINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PB3DIV ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned PBDIV:7;
  unsigned :4;
  unsigned PBDIVRDY:1;
  unsigned :3;
  unsigned ON:1;
} __PB3DIVbits_t;
extern volatile __PB3DIVbits_t PB3DIVbits ;//__asm__ ("PB3DIV") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PB3DIVCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PB3DIVSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PB3DIVINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PB4DIV ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned PBDIV:7;
  unsigned :4;
  unsigned PBDIVRDY:1;
  unsigned :3;
  unsigned ON:1;
} __PB4DIVbits_t;
extern volatile __PB4DIVbits_t PB4DIVbits ;//__asm__ ("PB4DIV") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PB4DIVCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PB4DIVSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PB4DIVINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PB5DIV ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned PBDIV:7;
  unsigned :4;
  unsigned PBDIVRDY:1;
  unsigned :3;
  unsigned ON:1;
} __PB5DIVbits_t;
extern volatile __PB5DIVbits_t PB5DIVbits ;//__asm__ ("PB5DIV") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PB5DIVCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PB5DIVSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PB5DIVINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PB7DIV ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned PBDIV:7;
  unsigned :4;
  unsigned PBDIVRDY:1;
  unsigned :3;
  unsigned ON:1;
} __PB7DIVbits_t;
extern volatile __PB7DIVbits_t PB7DIVbits ;//__asm__ ("PB7DIV") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PB7DIVCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PB7DIVSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PB7DIVINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PB8DIV ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned PBDIV:7;
  unsigned :4;
  unsigned PBDIVRDY:1;
  unsigned :3;
  unsigned ON:1;
} __PB8DIVbits_t;
extern volatile __PB8DIVbits_t PB8DIVbits ;//__asm__ ("PB8DIV") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PB8DIVCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PB8DIVSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PB8DIVINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SLEWCON ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned BUSY:1;
  unsigned DNEN:1;
  unsigned UPEN:1;
  unsigned :5;
  unsigned SLWDIV:3;
  unsigned :5;
  unsigned SYSDIV:4;
} __SLEWCONbits_t;
extern volatile __SLEWCONbits_t SLEWCONbits ;//__asm__ ("SLEWCON") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SLEWCONCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SLEWCONSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SLEWCONINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CLKSTAT ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned FRCRDY:1;
    unsigned SPDIVRDY:1;
    unsigned POSCRDY:1;
    unsigned :1;
    unsigned SOSCRDY:1;
    unsigned LPRCRDY:1;
  };
  struct {
    unsigned :1;
    unsigned DIVSPLLRDY:1;
  };
} __CLKSTATbits_t;
extern volatile __CLKSTATbits_t CLKSTATbits ;//__asm__ ("CLKSTAT") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CLKSTATCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CLKSTATSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CLKSTATINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        INT1R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned INT1R:4;
} __INT1Rbits_t;
extern volatile __INT1Rbits_t INT1Rbits ;//__asm__ ("INT1R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        INT2R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned INT2R:4;
} __INT2Rbits_t;
