HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.h
extern volatile __INT2Rbits_t INT2Rbits ;//__asm__ ("INT2R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        INT3R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned INT3R:4;
} __INT3Rbits_t;
extern volatile __INT3Rbits_t INT3Rbits ;//__asm__ ("INT3R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        INT4R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned INT4R:4;
} __INT4Rbits_t;
extern volatile __INT4Rbits_t INT4Rbits ;//__asm__ ("INT4R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        T2CKR ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned T2CKR:4;
} __T2CKRbits_t;
extern volatile __T2CKRbits_t T2CKRbits ;//__asm__ ("T2CKR") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        T3CKR ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned T3CKR:4;
} __T3CKRbits_t;
extern volatile __T3CKRbits_t T3CKRbits ;//__asm__ ("T3CKR") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        T4CKR ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned T4CKR:4;
} __T4CKRbits_t;
extern volatile __T4CKRbits_t T4CKRbits ;//__asm__ ("T4CKR") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        T5CKR ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned T5CKR:4;
} __T5CKRbits_t;
extern volatile __T5CKRbits_t T5CKRbits ;//__asm__ ("T5CKR") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        T6CKR ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned T6CKR:4;
} __T6CKRbits_t;
extern volatile __T6CKRbits_t T6CKRbits ;//__asm__ ("T6CKR") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        T7CKR ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned T7CKR:4;
} __T7CKRbits_t;
extern volatile __T7CKRbits_t T7CKRbits ;//__asm__ ("T7CKR") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        T8CKR ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned T8CKR:4;
} __T8CKRbits_t;
extern volatile __T8CKRbits_t T8CKRbits ;//__asm__ ("T8CKR") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        T9CKR ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned T9CKR:4;
} __T9CKRbits_t;
extern volatile __T9CKRbits_t T9CKRbits ;//__asm__ ("T9CKR") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IC1R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned IC1R:4;
} __IC1Rbits_t;
extern volatile __IC1Rbits_t IC1Rbits ;//__asm__ ("IC1R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IC2R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned IC2R:4;
} __IC2Rbits_t;
extern volatile __IC2Rbits_t IC2Rbits ;//__asm__ ("IC2R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IC3R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned IC3R:4;
} __IC3Rbits_t;
extern volatile __IC3Rbits_t IC3Rbits ;//__asm__ ("IC3R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IC4R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned IC4R:4;
} __IC4Rbits_t;
extern volatile __IC4Rbits_t IC4Rbits ;//__asm__ ("IC4R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IC5R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned IC5R:4;
} __IC5Rbits_t;
extern volatile __IC5Rbits_t IC5Rbits ;//__asm__ ("IC5R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IC6R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned IC6R:4;
} __IC6Rbits_t;
extern volatile __IC6Rbits_t IC6Rbits ;//__asm__ ("IC6R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IC7R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned IC7R:4;
} __IC7Rbits_t;
extern volatile __IC7Rbits_t IC7Rbits ;//__asm__ ("IC7R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IC8R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned IC8R:4;
} __IC8Rbits_t;
extern volatile __IC8Rbits_t IC8Rbits ;//__asm__ ("IC8R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IC9R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned IC9R:4;
} __IC9Rbits_t;
extern volatile __IC9Rbits_t IC9Rbits ;//__asm__ ("IC9R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OCFAR ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned OCFAR:4;
} __OCFARbits_t;
extern volatile __OCFARbits_t OCFARbits ;//__asm__ ("OCFAR") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        U1RXR ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned U1RXR:4;
} __U1RXRbits_t;
extern volatile __U1RXRbits_t U1RXRbits ;//__asm__ ("U1RXR") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        U1CTSR ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned U1CTSR:4;
} __U1CTSRbits_t;
extern volatile __U1CTSRbits_t U1CTSRbits ;//__asm__ ("U1CTSR") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        U2RXR ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned U2RXR:4;
} __U2RXRbits_t;
extern volatile __U2RXRbits_t U2RXRbits ;//__asm__ ("U2RXR") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        U2CTSR ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned U2CTSR:4;
} __U2CTSRbits_t;
extern volatile __U2CTSRbits_t U2CTSRbits ;//__asm__ ("U2CTSR") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        U3RXR ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned U3RXR:4;
} __U3RXRbits_t;
extern volatile __U3RXRbits_t U3RXRbits ;//__asm__ ("U3RXR") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        U3CTSR ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned U3CTSR:4;
} __U3CTSRbits_t;
extern volatile __U3CTSRbits_t U3CTSRbits ;//__asm__ ("U3CTSR") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        U4RXR ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned U4RXR:4;
} __U4RXRbits_t;
extern volatile __U4RXRbits_t U4RXRbits ;//__asm__ ("U4RXR") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        U4CTSR ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned U4CTSR:4;
} __U4CTSRbits_t;
extern volatile __U4CTSRbits_t U4CTSRbits ;//__asm__ ("U4CTSR") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        U5RXR ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned U5RXR:4;
} __U5RXRbits_t;
