HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.h
extern volatile __U5RXRbits_t U5RXRbits ;//__asm__ ("U5RXR") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        U5CTSR ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned U5CTSR:4;
} __U5CTSRbits_t;
extern volatile __U5CTSRbits_t U5CTSRbits ;//__asm__ ("U5CTSR") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        U6RXR ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned U6RXR:4;
} __U6RXRbits_t;
extern volatile __U6RXRbits_t U6RXRbits ;//__asm__ ("U6RXR") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        U6CTSR ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned U6CTSR:4;
} __U6CTSRbits_t;
extern volatile __U6CTSRbits_t U6CTSRbits ;//__asm__ ("U6CTSR") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SDI1R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned SDI1R:4;
} __SDI1Rbits_t;
extern volatile __SDI1Rbits_t SDI1Rbits ;//__asm__ ("SDI1R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SS1R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned SS1R:4;
} __SS1Rbits_t;
extern volatile __SS1Rbits_t SS1Rbits ;//__asm__ ("SS1R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SDI2R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned SDI2R:4;
} __SDI2Rbits_t;
extern volatile __SDI2Rbits_t SDI2Rbits ;//__asm__ ("SDI2R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SS2R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned SS2R:4;
} __SS2Rbits_t;
extern volatile __SS2Rbits_t SS2Rbits ;//__asm__ ("SS2R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SDI3R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned SDI3R:4;
} __SDI3Rbits_t;
extern volatile __SDI3Rbits_t SDI3Rbits ;//__asm__ ("SDI3R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SS3R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned SS3R:4;
} __SS3Rbits_t;
extern volatile __SS3Rbits_t SS3Rbits ;//__asm__ ("SS3R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SDI4R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned SDI4R:4;
} __SDI4Rbits_t;
extern volatile __SDI4Rbits_t SDI4Rbits ;//__asm__ ("SDI4R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SS4R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned SS4R:4;
} __SS4Rbits_t;
extern volatile __SS4Rbits_t SS4Rbits ;//__asm__ ("SS4R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SDI5R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned SDI5R:4;
} __SDI5Rbits_t;
extern volatile __SDI5Rbits_t SDI5Rbits ;//__asm__ ("SDI5R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SS5R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned SS5R:4;
} __SS5Rbits_t;
extern volatile __SS5Rbits_t SS5Rbits ;//__asm__ ("SS5R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SDI6R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned SDI6R:4;
} __SDI6Rbits_t;
extern volatile __SDI6Rbits_t SDI6Rbits ;//__asm__ ("SDI6R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SS6R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned SS6R:4;
} __SS6Rbits_t;
extern volatile __SS6Rbits_t SS6Rbits ;//__asm__ ("SS6R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        C1RXR ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned C1RXR:4;
} __C1RXRbits_t;
extern volatile __C1RXRbits_t C1RXRbits ;//__asm__ ("C1RXR") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        C2RXR ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned C2RXR:4;
} __C2RXRbits_t;
extern volatile __C2RXRbits_t C2RXRbits ;//__asm__ ("C2RXR") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        REFCLKI1R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned REFCLKI1R:4;
} __REFCLKI1Rbits_t;
extern volatile __REFCLKI1Rbits_t REFCLKI1Rbits ;//__asm__ ("REFCLKI1R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        REFCLKI3R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned REFCLKI3R:4;
} __REFCLKI3Rbits_t;
extern volatile __REFCLKI3Rbits_t REFCLKI3Rbits ;//__asm__ ("REFCLKI3R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        REFCLKI4R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned REFCLKI4R:4;
} __REFCLKI4Rbits_t;
extern volatile __REFCLKI4Rbits_t REFCLKI4Rbits ;//__asm__ ("REFCLKI4R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RPA14R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned RPA14R:4;
} __RPA14Rbits_t;
extern volatile __RPA14Rbits_t RPA14Rbits ;//__asm__ ("RPA14R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RPA15R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned RPA15R:4;
} __RPA15Rbits_t;
extern volatile __RPA15Rbits_t RPA15Rbits ;//__asm__ ("RPA15R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RPB0R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned RPB0R:4;
} __RPB0Rbits_t;
extern volatile __RPB0Rbits_t RPB0Rbits ;//__asm__ ("RPB0R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RPB1R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned RPB1R:4;
} __RPB1Rbits_t;
extern volatile __RPB1Rbits_t RPB1Rbits ;//__asm__ ("RPB1R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RPB2R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned RPB2R:4;
} __RPB2Rbits_t;
extern volatile __RPB2Rbits_t RPB2Rbits ;//__asm__ ("RPB2R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RPB3R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned RPB3R:4;
} __RPB3Rbits_t;
extern volatile __RPB3Rbits_t RPB3Rbits ;//__asm__ ("RPB3R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RPB5R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned RPB5R:4;
} __RPB5Rbits_t;
extern volatile __RPB5Rbits_t RPB5Rbits ;//__asm__ ("RPB5R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RPB6R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned RPB6R:4;
} __RPB6Rbits_t;
extern volatile __RPB6Rbits_t RPB6Rbits ;//__asm__ ("RPB6R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RPB7R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned RPB7R:4;
} __RPB7Rbits_t;
extern volatile __RPB7Rbits_t RPB7Rbits ;//__asm__ ("RPB7R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RPB8R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned RPB8R:4;
} __RPB8Rbits_t;
extern volatile __RPB8Rbits_t RPB8Rbits ;//__asm__ ("RPB8R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RPB9R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned RPB9R:4;
} __RPB9Rbits_t;
