HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.h
extern volatile __RPB9Rbits_t RPB9Rbits ;//__asm__ ("RPB9R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RPB10R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned RPB10R:4;
} __RPB10Rbits_t;
extern volatile __RPB10Rbits_t RPB10Rbits ;//__asm__ ("RPB10R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RPB14R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned RPB14R:4;
} __RPB14Rbits_t;
extern volatile __RPB14Rbits_t RPB14Rbits ;//__asm__ ("RPB14R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RPB15R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned RPB15R:4;
} __RPB15Rbits_t;
extern volatile __RPB15Rbits_t RPB15Rbits ;//__asm__ ("RPB15R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RPC1R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned RPC1R:4;
} __RPC1Rbits_t;
extern volatile __RPC1Rbits_t RPC1Rbits ;//__asm__ ("RPC1R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RPC2R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned RPC2R:4;
} __RPC2Rbits_t;
extern volatile __RPC2Rbits_t RPC2Rbits ;//__asm__ ("RPC2R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RPC3R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned RPC3R:4;
} __RPC3Rbits_t;
extern volatile __RPC3Rbits_t RPC3Rbits ;//__asm__ ("RPC3R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RPC4R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned RPC4R:4;
} __RPC4Rbits_t;
extern volatile __RPC4Rbits_t RPC4Rbits ;//__asm__ ("RPC4R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RPC13R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned RPC13R:4;
} __RPC13Rbits_t;
extern volatile __RPC13Rbits_t RPC13Rbits ;//__asm__ ("RPC13R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RPC14R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned RPC14R:4;
} __RPC14Rbits_t;
extern volatile __RPC14Rbits_t RPC14Rbits ;//__asm__ ("RPC14R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RPD0R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned RPD0R:4;
} __RPD0Rbits_t;
extern volatile __RPD0Rbits_t RPD0Rbits ;//__asm__ ("RPD0R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RPD1R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned RPD1R:4;
} __RPD1Rbits_t;
extern volatile __RPD1Rbits_t RPD1Rbits ;//__asm__ ("RPD1R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RPD2R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned RPD2R:4;
} __RPD2Rbits_t;
extern volatile __RPD2Rbits_t RPD2Rbits ;//__asm__ ("RPD2R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RPD3R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned RPD3R:4;
} __RPD3Rbits_t;
extern volatile __RPD3Rbits_t RPD3Rbits ;//__asm__ ("RPD3R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RPD4R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned RPD4R:4;
} __RPD4Rbits_t;
extern volatile __RPD4Rbits_t RPD4Rbits ;//__asm__ ("RPD4R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RPD5R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned RPD5R:4;
} __RPD5Rbits_t;
extern volatile __RPD5Rbits_t RPD5Rbits ;//__asm__ ("RPD5R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RPD9R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned RPD9R:4;
} __RPD9Rbits_t;
extern volatile __RPD9Rbits_t RPD9Rbits ;//__asm__ ("RPD9R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RPD10R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned RPD10R:4;
} __RPD10Rbits_t;
extern volatile __RPD10Rbits_t RPD10Rbits ;//__asm__ ("RPD10R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RPD11R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned RPD11R:4;
} __RPD11Rbits_t;
extern volatile __RPD11Rbits_t RPD11Rbits ;//__asm__ ("RPD11R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RPD12R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned RPD12R:4;
} __RPD12Rbits_t;
extern volatile __RPD12Rbits_t RPD12Rbits ;//__asm__ ("RPD12R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RPD14R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned RPD14R:4;
} __RPD14Rbits_t;
extern volatile __RPD14Rbits_t RPD14Rbits ;//__asm__ ("RPD14R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RPD15R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned RPD15R:4;
} __RPD15Rbits_t;
extern volatile __RPD15Rbits_t RPD15Rbits ;//__asm__ ("RPD15R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RPE3R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned RPE3R:4;
} __RPE3Rbits_t;
extern volatile __RPE3Rbits_t RPE3Rbits ;//__asm__ ("RPE3R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RPE5R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned RPE5R:4;
} __RPE5Rbits_t;
extern volatile __RPE5Rbits_t RPE5Rbits ;//__asm__ ("RPE5R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RPE8R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned RPE8R:4;
} __RPE8Rbits_t;
extern volatile __RPE8Rbits_t RPE8Rbits ;//__asm__ ("RPE8R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RPE9R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned RPE9R:4;
} __RPE9Rbits_t;
extern volatile __RPE9Rbits_t RPE9Rbits ;//__asm__ ("RPE9R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RPF0R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned RPF0R:4;
} __RPF0Rbits_t;
