HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.h
extern volatile __RPF0Rbits_t RPF0Rbits ;//__asm__ ("RPF0R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RPF1R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned RPF1R:4;
} __RPF1Rbits_t;
extern volatile __RPF1Rbits_t RPF1Rbits ;//__asm__ ("RPF1R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RPF2R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned RPF2R:4;
} __RPF2Rbits_t;
extern volatile __RPF2Rbits_t RPF2Rbits ;//__asm__ ("RPF2R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RPF3R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned RPF3R:4;
} __RPF3Rbits_t;
extern volatile __RPF3Rbits_t RPF3Rbits ;//__asm__ ("RPF3R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RPF4R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned RPF4R:4;
} __RPF4Rbits_t;
extern volatile __RPF4Rbits_t RPF4Rbits ;//__asm__ ("RPF4R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RPF5R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned RPF5R:4;
} __RPF5Rbits_t;
extern volatile __RPF5Rbits_t RPF5Rbits ;//__asm__ ("RPF5R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RPF8R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned RPF8R:4;
} __RPF8Rbits_t;
extern volatile __RPF8Rbits_t RPF8Rbits ;//__asm__ ("RPF8R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RPF12R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned RPF12R:4;
} __RPF12Rbits_t;
extern volatile __RPF12Rbits_t RPF12Rbits ;//__asm__ ("RPF12R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RPF13R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned RPF13R:4;
} __RPF13Rbits_t;
extern volatile __RPF13Rbits_t RPF13Rbits ;//__asm__ ("RPF13R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RPG0R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned RPG0R:4;
} __RPG0Rbits_t;
extern volatile __RPG0Rbits_t RPG0Rbits ;//__asm__ ("RPG0R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RPG1R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned RPG1R:4;
} __RPG1Rbits_t;
extern volatile __RPG1Rbits_t RPG1Rbits ;//__asm__ ("RPG1R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RPG6R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned RPG6R:4;
} __RPG6Rbits_t;
extern volatile __RPG6Rbits_t RPG6Rbits ;//__asm__ ("RPG6R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RPG7R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned RPG7R:4;
} __RPG7Rbits_t;
extern volatile __RPG7Rbits_t RPG7Rbits ;//__asm__ ("RPG7R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RPG8R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned RPG8R:4;
} __RPG8Rbits_t;
extern volatile __RPG8Rbits_t RPG8Rbits ;//__asm__ ("RPG8R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        RPG9R ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned RPG9R:4;
} __RPG9Rbits_t;
extern volatile __RPG9Rbits_t RPG9Rbits ;//__asm__ ("RPG9R") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        INTCON ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned INT0EP:1;
  unsigned INT1EP:1;
  unsigned INT2EP:1;
  unsigned INT3EP:1;
  unsigned INT4EP:1;
  unsigned :3;
  unsigned TPC:3;
  unsigned :1;
  unsigned MVEC:1;
  unsigned :11;
  unsigned NMIKEY:8;
} __INTCONbits_t;
extern volatile __INTCONbits_t INTCONbits ;//__asm__ ("INTCON") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        INTCONCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        INTCONSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        INTCONINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PRISS ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned SS0:1;
  unsigned :3;
  unsigned PRI1SS:4;
  unsigned PRI2SS:4;
  unsigned PRI3SS:4;
  unsigned PRI4SS:4;
  unsigned PRI5SS:4;
  unsigned PRI6SS:4;
  unsigned PRI7SS:4;
} __PRISSbits_t;
extern volatile __PRISSbits_t PRISSbits ;//__asm__ ("PRISS") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PRISSCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PRISSSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PRISSINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        INTSTAT ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned SIRQ:8;
  unsigned SRIPL:3;
} __INTSTATbits_t;
extern volatile __INTSTATbits_t INTSTATbits ;//__asm__ ("INTSTAT") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        INTSTATCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        INTSTATSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        INTSTATINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPTMR ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned IPTMR:32;
} __IPTMRbits_t;
extern volatile __IPTMRbits_t IPTMRbits ;//__asm__ ("IPTMR") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPTMRCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPTMRSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPTMRINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IFS0 ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CTIF:1;
    unsigned CS0IF:1;
    unsigned CS1IF:1;
    unsigned INT0IF:1;
    unsigned T1IF:1;
    unsigned IC1EIF:1;
    unsigned IC1IF:1;
    unsigned OC1IF:1;
    unsigned INT1IF:1;
    unsigned T2IF:1;
    unsigned IC2EIF:1;
    unsigned IC2IF:1;
    unsigned OC2IF:1;
    unsigned INT2IF:1;
    unsigned T3IF:1;
    unsigned IC3EIF:1;
    unsigned IC3IF:1;
    unsigned OC3IF:1;
    unsigned INT3IF:1;
    unsigned T4IF:1;
    unsigned IC4EIF:1;
    unsigned IC4IF:1;
    unsigned OC4IF:1;
    unsigned INT4IF:1;
    unsigned T5IF:1;
    unsigned IC5EIF:1;
    unsigned IC5IF:1;
    unsigned OC5IF:1;
    unsigned T6IF:1;
    unsigned IC6EIF:1;
    unsigned IC6IF:1;
    unsigned OC6IF:1;
  };
  struct {
    unsigned w:32;
  };
} __IFS0bits_t;
extern volatile __IFS0bits_t IFS0bits ;//__asm__ ("IFS0") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IFS0CLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IFS0SET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IFS0INV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IFS1 ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned T7IF:1;
    unsigned IC7EIF:1;
    unsigned IC7IF:1;
    unsigned OC7IF:1;
    unsigned T8IF:1;
    unsigned IC8EIF:1;
    unsigned IC8IF:1;
    unsigned OC8IF:1;
    unsigned T9IF:1;
    unsigned IC9EIF:1;
    unsigned IC9IF:1;
    unsigned OC9IF:1;
    unsigned ADCIF:1;
    unsigned :1;
    unsigned ADCDC1IF:1;
    unsigned ADCDC2IF:1;
    unsigned ADCDC3IF:1;
    unsigned ADCDC4IF:1;
    unsigned ADCDC5IF:1;
    unsigned ADCDC6IF:1;
    unsigned ADCDF1IF:1;
    unsigned ADCDF2IF:1;
    unsigned ADCDF3IF:1;
    unsigned ADCDF4IF:1;
    unsigned ADCDF5IF:1;
    unsigned ADCDF6IF:1;
    unsigned ADCFLTIF:1;
    unsigned ADCD0IF:1;
    unsigned ADCD1IF:1;
    unsigned ADCD2IF:1;
    unsigned ADCD3IF:1;
    unsigned ADCD4IF:1;
  };
  struct {
    unsigned w:32;
  };
} __IFS1bits_t;
