HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.h
extern volatile __IPC2bits_t IPC2bits ;//__asm__ ("IPC2") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC2CLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC2SET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC2INV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC3 ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned OC2IS:2;
    unsigned OC2IP:3;
    unsigned :3;
    unsigned INT2IS:2;
    unsigned INT2IP:3;
    unsigned :3;
    unsigned T3IS:2;
    unsigned T3IP:3;
    unsigned :3;
    unsigned IC3EIS:2;
    unsigned IC3EIP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC3bits_t;
extern volatile __IPC3bits_t IPC3bits ;//__asm__ ("IPC3") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC3CLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC3SET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC3INV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC4 ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned IC3IS:2;
    unsigned IC3IP:3;
    unsigned :3;
    unsigned OC3IS:2;
    unsigned OC3IP:3;
    unsigned :3;
    unsigned INT3IS:2;
    unsigned INT3IP:3;
    unsigned :3;
    unsigned T4IS:2;
    unsigned T4IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC4bits_t;
extern volatile __IPC4bits_t IPC4bits ;//__asm__ ("IPC4") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC4CLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC4SET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC4INV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC5 ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned IC4EIS:2;
    unsigned IC4EIP:3;
    unsigned :3;
    unsigned IC4IS:2;
    unsigned IC4IP:3;
    unsigned :3;
    unsigned OC4IS:2;
    unsigned OC4IP:3;
    unsigned :3;
    unsigned INT4IS:2;
    unsigned INT4IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC5bits_t;
extern volatile __IPC5bits_t IPC5bits ;//__asm__ ("IPC5") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC5CLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC5SET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC5INV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC6 ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned T5IS:2;
    unsigned T5IP:3;
    unsigned :3;
    unsigned IC5EIS:2;
    unsigned IC5EIP:3;
    unsigned :3;
    unsigned IC5IS:2;
    unsigned IC5IP:3;
    unsigned :3;
    unsigned OC5IS:2;
    unsigned OC5IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC6bits_t;
extern volatile __IPC6bits_t IPC6bits ;//__asm__ ("IPC6") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC6CLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC6SET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC6INV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC7 ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned T6IS:2;
    unsigned T6IP:3;
    unsigned :3;
    unsigned IC6EIS:2;
    unsigned IC6EIP:3;
    unsigned :3;
    unsigned IC6IS:2;
    unsigned IC6IP:3;
    unsigned :3;
    unsigned OC6IS:2;
    unsigned OC6IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC7bits_t;
extern volatile __IPC7bits_t IPC7bits ;//__asm__ ("IPC7") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC7CLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC7SET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC7INV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC8 ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned T7IS:2;
    unsigned T7IP:3;
    unsigned :3;
    unsigned IC7EIS:2;
    unsigned IC7EIP:3;
    unsigned :3;
    unsigned IC7IS:2;
    unsigned IC7IP:3;
    unsigned :3;
    unsigned OC7IS:2;
    unsigned OC7IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC8bits_t;
extern volatile __IPC8bits_t IPC8bits ;//__asm__ ("IPC8") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC8CLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC8SET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC8INV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC9 ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned T8IS:2;
    unsigned T8IP:3;
    unsigned :3;
    unsigned IC8EIS:2;
    unsigned IC8EIP:3;
    unsigned :3;
    unsigned IC8IS:2;
    unsigned IC8IP:3;
    unsigned :3;
    unsigned OC8IS:2;
    unsigned OC8IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC9bits_t;
extern volatile __IPC9bits_t IPC9bits ;//__asm__ ("IPC9") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC9CLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC9SET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC9INV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC10 ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned T9IS:2;
    unsigned T9IP:3;
    unsigned :3;
    unsigned IC9EIS:2;
    unsigned IC9EIP:3;
    unsigned :3;
    unsigned IC9IS:2;
    unsigned IC9IP:3;
    unsigned :3;
    unsigned OC9IS:2;
    unsigned OC9IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC10bits_t;
extern volatile __IPC10bits_t IPC10bits ;//__asm__ ("IPC10") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC10CLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC10SET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC10INV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC11 ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned ADCIS:2;
    unsigned ADCIP:3;
    unsigned :11;
    unsigned ADCDC1IS:2;
    unsigned ADCDC1IP:3;
    unsigned :3;
    unsigned ADCDC2IS:2;
    unsigned ADCDC2IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC11bits_t;
