HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.h
extern volatile __IPC11bits_t IPC11bits ;//__asm__ ("IPC11") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC11CLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC11SET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC11INV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC12 ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned ADCDC3IS:2;
    unsigned ADCDC3IP:3;
    unsigned :3;
    unsigned ADCDC4IS:2;
    unsigned ADCDC4IP:3;
    unsigned :3;
    unsigned ADCDC5IS:2;
    unsigned ADCDC5IP:3;
    unsigned :3;
    unsigned ADCDC6IS:2;
    unsigned ADCDC6IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC12bits_t;
extern volatile __IPC12bits_t IPC12bits ;//__asm__ ("IPC12") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC12CLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC12SET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC12INV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC13 ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned ADCDF1IS:2;
    unsigned ADCDF1IP:3;
    unsigned :3;
    unsigned ADCDF2IS:2;
    unsigned ADCDF2IP:3;
    unsigned :3;
    unsigned ADCDF3IS:2;
    unsigned ADCDF3IP:3;
    unsigned :3;
    unsigned ADCDF4IS:2;
    unsigned ADCDF4IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC13bits_t;
extern volatile __IPC13bits_t IPC13bits ;//__asm__ ("IPC13") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC13CLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC13SET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC13INV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC14 ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned ADCDF5IS:2;
    unsigned ADCDF5IP:3;
    unsigned :3;
    unsigned ADCDF6IS:2;
    unsigned ADCDF6IP:3;
    unsigned :3;
    unsigned ADCFLTIS:2;
    unsigned ADCFLTIP:3;
    unsigned :3;
    unsigned ADCD0IS:2;
    unsigned ADCD0IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC14bits_t;
extern volatile __IPC14bits_t IPC14bits ;//__asm__ ("IPC14") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC14CLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC14SET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC14INV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC15 ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned ADCD1IS:2;
    unsigned ADCD1IP:3;
    unsigned :3;
    unsigned ADCD2IS:2;
    unsigned ADCD2IP:3;
    unsigned :3;
    unsigned ADCD3IS:2;
    unsigned ADCD3IP:3;
    unsigned :3;
    unsigned ADCD4IS:2;
    unsigned ADCD4IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC15bits_t;
extern volatile __IPC15bits_t IPC15bits ;//__asm__ ("IPC15") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC15CLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC15SET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC15INV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC16 ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned ADCD5IS:2;
    unsigned ADCD5IP:3;
    unsigned :3;
    unsigned ADCD6IS:2;
    unsigned ADCD6IP:3;
    unsigned :3;
    unsigned ADCD7IS:2;
    unsigned ADCD7IP:3;
    unsigned :3;
    unsigned ADCD8IS:2;
    unsigned ADCD8IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC16bits_t;
extern volatile __IPC16bits_t IPC16bits ;//__asm__ ("IPC16") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC16CLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC16SET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC16INV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC17 ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned ADCD9IS:2;
    unsigned ADCD9IP:3;
    unsigned :3;
    unsigned ADCD10IS:2;
    unsigned ADCD10IP:3;
    unsigned :3;
    unsigned ADCD11IS:2;
    unsigned ADCD11IP:3;
    unsigned :3;
    unsigned ADCD12IS:2;
    unsigned ADCD12IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC17bits_t;
extern volatile __IPC17bits_t IPC17bits ;//__asm__ ("IPC17") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC17CLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC17SET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC17INV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC18 ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned ADCD13IS:2;
    unsigned ADCD13IP:3;
    unsigned :3;
    unsigned ADCD14IS:2;
    unsigned ADCD14IP:3;
    unsigned :3;
    unsigned ADCD15IS:2;
    unsigned ADCD15IP:3;
    unsigned :3;
    unsigned ADCD16IS:2;
    unsigned ADCD16IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC18bits_t;
extern volatile __IPC18bits_t IPC18bits ;//__asm__ ("IPC18") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC18CLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC18SET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC18INV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC19 ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned ADCD17IS:2;
    unsigned ADCD17IP:3;
    unsigned :3;
    unsigned ADCD18IS:2;
    unsigned ADCD18IP:3;
    unsigned :3;
    unsigned ADCD19IS:2;
    unsigned ADCD19IP:3;
    unsigned :3;
    unsigned ADCD20IS:2;
    unsigned ADCD20IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC19bits_t;
