HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.h
extern volatile __IPC41bits_t IPC41bits ;//__asm__ ("IPC41") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC41CLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC41SET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC41INV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC42 ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned PREIS:2;
    unsigned PREIP:3;
    unsigned :3;
    unsigned SQI1IS:2;
    unsigned SQI1IP:3;
    unsigned :3;
    unsigned U4EIS:2;
    unsigned U4EIP:3;
    unsigned :3;
    unsigned U4RXIS:2;
    unsigned U4RXIP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC42bits_t;
extern volatile __IPC42bits_t IPC42bits ;//__asm__ ("IPC42") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC42CLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC42SET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC42INV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC43 ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned U4TXIS:2;
    unsigned U4TXIP:3;
    unsigned :3;
    unsigned I2C4BIS:2;
    unsigned I2C4BIP:3;
    unsigned :3;
    unsigned I2C4SIS:2;
    unsigned I2C4SIP:3;
    unsigned :3;
    unsigned I2C4MIS:2;
    unsigned I2C4MIP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC43bits_t;
extern volatile __IPC43bits_t IPC43bits ;//__asm__ ("IPC43") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC43CLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC43SET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC43INV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC44 ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned SPI5EIS:2;
    unsigned SPI5EIP:3;
    unsigned :3;
    unsigned SPI5RXIS:2;
    unsigned SPI5RXIP:3;
    unsigned :3;
    unsigned SPI5TXIS:2;
    unsigned SPI5TXIP:3;
    unsigned :3;
    unsigned U5EIS:2;
    unsigned U5EIP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC44bits_t;
extern volatile __IPC44bits_t IPC44bits ;//__asm__ ("IPC44") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC44CLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC44SET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC44INV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC45 ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned U5RXIS:2;
    unsigned U5RXIP:3;
    unsigned :3;
    unsigned U5TXIS:2;
    unsigned U5TXIP:3;
    unsigned :3;
    unsigned I2C5BIS:2;
    unsigned I2C5BIP:3;
    unsigned :3;
    unsigned I2C5SIS:2;
    unsigned I2C5SIP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC45bits_t;
extern volatile __IPC45bits_t IPC45bits ;//__asm__ ("IPC45") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC45CLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC45SET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC45INV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC46 ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned I2C5MIS:2;
    unsigned I2C5MIP:3;
    unsigned :3;
    unsigned SPI6EIS:2;
    unsigned SPI6EIP:3;
    unsigned :3;
    unsigned SPI6RXIS:2;
    unsigned SPI6RXIP:3;
    unsigned :3;
    unsigned SPI6TXIS:2;
    unsigned SPI6TXIP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC46bits_t;
extern volatile __IPC46bits_t IPC46bits ;//__asm__ ("IPC46") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC46CLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC46SET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC46INV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC47 ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned U6EIS:2;
    unsigned U6EIP:3;
    unsigned :3;
    unsigned U6RXIS:2;
    unsigned U6RXIP:3;
    unsigned :3;
    unsigned U6TXIS:2;
    unsigned U6TXIP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC47bits_t;
extern volatile __IPC47bits_t IPC47bits ;//__asm__ ("IPC47") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC47CLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC47SET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC47INV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC48 ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned ADCEOSIS:2;
    unsigned ADCEOSIP:3;
    unsigned :3;
    unsigned ADCARDYIS:2;
    unsigned ADCARDYIP:3;
    unsigned :3;
    unsigned ADCURDYIS:2;
    unsigned ADCURDYIP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC48bits_t;
extern volatile __IPC48bits_t IPC48bits ;//__asm__ ("IPC48") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC48CLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC48SET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC48INV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC49 ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned ADCGRPIS:2;
    unsigned ADCGRPIP:3;
    unsigned :11;
    unsigned ADC0EIS:2;
    unsigned ADC0EIP:3;
    unsigned :3;
    unsigned ADC1EIS:2;
    unsigned ADC1EIP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC49bits_t;
extern volatile __IPC49bits_t IPC49bits ;//__asm__ ("IPC49") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC49CLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC49SET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC49INV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC50 ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned ADC2EIS:2;
    unsigned ADC2EIP:3;
    unsigned :3;
    unsigned ADC3EIS:2;
    unsigned ADC3EIP:3;
    unsigned :3;
    unsigned ADC4EIS:2;
    unsigned ADC4EIP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC50bits_t;
