HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.h
extern volatile __IPC50bits_t IPC50bits ;//__asm__ ("IPC50") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC50CLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC50SET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC50INV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC51 ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned :8;
    unsigned ADC7EIS:2;
    unsigned ADC7EIP:3;
    unsigned :3;
    unsigned ADC0WIS:2;
    unsigned ADC0WIP:3;
    unsigned :3;
    unsigned ADC1WIS:2;
    unsigned ADC1WIP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC51bits_t;
extern volatile __IPC51bits_t IPC51bits ;//__asm__ ("IPC51") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC51CLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC51SET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC51INV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC52 ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned ADC2WIS:2;
    unsigned ADC2WIP:3;
    unsigned :3;
    unsigned ADC3WIS:2;
    unsigned ADC3WIP:3;
    unsigned :3;
    unsigned ADC4WIS:2;
    unsigned ADC4WIP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC52bits_t;
extern volatile __IPC52bits_t IPC52bits ;//__asm__ ("IPC52") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC52CLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC52SET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC52INV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC53 ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned :8;
    unsigned ADC7WIS:2;
    unsigned ADC7WIP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC53bits_t;
extern volatile __IPC53bits_t IPC53bits ;//__asm__ ("IPC53") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC53CLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC53SET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IPC53INV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF000 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF000bits_t;
extern volatile __OFF000bits_t OFF000bits ;//__asm__ ("OFF000") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF001 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF001bits_t;
extern volatile __OFF001bits_t OFF001bits ;//__asm__ ("OFF001") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF002 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF002bits_t;
extern volatile __OFF002bits_t OFF002bits ;//__asm__ ("OFF002") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF003 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF003bits_t;
extern volatile __OFF003bits_t OFF003bits ;//__asm__ ("OFF003") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF004 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF004bits_t;
extern volatile __OFF004bits_t OFF004bits ;//__asm__ ("OFF004") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF005 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF005bits_t;
extern volatile __OFF005bits_t OFF005bits ;//__asm__ ("OFF005") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF006 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF006bits_t;
extern volatile __OFF006bits_t OFF006bits ;//__asm__ ("OFF006") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF007 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF007bits_t;
extern volatile __OFF007bits_t OFF007bits ;//__asm__ ("OFF007") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF008 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF008bits_t;
extern volatile __OFF008bits_t OFF008bits ;//__asm__ ("OFF008") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF009 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF009bits_t;
extern volatile __OFF009bits_t OFF009bits ;//__asm__ ("OFF009") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF010 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF010bits_t;
extern volatile __OFF010bits_t OFF010bits ;//__asm__ ("OFF010") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF011 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF011bits_t;
extern volatile __OFF011bits_t OFF011bits ;//__asm__ ("OFF011") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF012 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF012bits_t;
extern volatile __OFF012bits_t OFF012bits ;//__asm__ ("OFF012") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF013 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF013bits_t;
extern volatile __OFF013bits_t OFF013bits ;//__asm__ ("OFF013") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF014 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF014bits_t;
extern volatile __OFF014bits_t OFF014bits ;//__asm__ ("OFF014") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF015 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF015bits_t;
extern volatile __OFF015bits_t OFF015bits ;//__asm__ ("OFF015") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF016 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF016bits_t;
