HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.h
extern volatile __OFF016bits_t OFF016bits ;//__asm__ ("OFF016") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF017 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF017bits_t;
extern volatile __OFF017bits_t OFF017bits ;//__asm__ ("OFF017") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF018 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF018bits_t;
extern volatile __OFF018bits_t OFF018bits ;//__asm__ ("OFF018") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF019 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF019bits_t;
extern volatile __OFF019bits_t OFF019bits ;//__asm__ ("OFF019") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF020 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF020bits_t;
extern volatile __OFF020bits_t OFF020bits ;//__asm__ ("OFF020") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF021 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF021bits_t;
extern volatile __OFF021bits_t OFF021bits ;//__asm__ ("OFF021") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF022 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF022bits_t;
extern volatile __OFF022bits_t OFF022bits ;//__asm__ ("OFF022") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF023 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF023bits_t;
extern volatile __OFF023bits_t OFF023bits ;//__asm__ ("OFF023") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF024 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF024bits_t;
extern volatile __OFF024bits_t OFF024bits ;//__asm__ ("OFF024") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF025 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF025bits_t;
extern volatile __OFF025bits_t OFF025bits ;//__asm__ ("OFF025") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF026 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF026bits_t;
extern volatile __OFF026bits_t OFF026bits ;//__asm__ ("OFF026") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF027 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF027bits_t;
extern volatile __OFF027bits_t OFF027bits ;//__asm__ ("OFF027") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF028 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF028bits_t;
extern volatile __OFF028bits_t OFF028bits ;//__asm__ ("OFF028") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF029 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF029bits_t;
extern volatile __OFF029bits_t OFF029bits ;//__asm__ ("OFF029") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF030 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF030bits_t;
extern volatile __OFF030bits_t OFF030bits ;//__asm__ ("OFF030") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF031 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF031bits_t;
extern volatile __OFF031bits_t OFF031bits ;//__asm__ ("OFF031") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF032 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF032bits_t;
extern volatile __OFF032bits_t OFF032bits ;//__asm__ ("OFF032") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF033 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF033bits_t;
extern volatile __OFF033bits_t OFF033bits ;//__asm__ ("OFF033") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF034 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF034bits_t;
extern volatile __OFF034bits_t OFF034bits ;//__asm__ ("OFF034") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF035 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF035bits_t;
extern volatile __OFF035bits_t OFF035bits ;//__asm__ ("OFF035") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF036 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF036bits_t;
extern volatile __OFF036bits_t OFF036bits ;//__asm__ ("OFF036") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF037 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF037bits_t;
extern volatile __OFF037bits_t OFF037bits ;//__asm__ ("OFF037") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF038 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF038bits_t;
extern volatile __OFF038bits_t OFF038bits ;//__asm__ ("OFF038") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF039 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF039bits_t;
extern volatile __OFF039bits_t OFF039bits ;//__asm__ ("OFF039") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF040 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF040bits_t;
extern volatile __OFF040bits_t OFF040bits ;//__asm__ ("OFF040") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF041 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF041bits_t;
extern volatile __OFF041bits_t OFF041bits ;//__asm__ ("OFF041") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF042 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF042bits_t;
extern volatile __OFF042bits_t OFF042bits ;//__asm__ ("OFF042") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF043 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF043bits_t;
extern volatile __OFF043bits_t OFF043bits ;//__asm__ ("OFF043") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF044 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF044bits_t;
