HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.h
extern volatile __OFF044bits_t OFF044bits ;//__asm__ ("OFF044") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF046 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF046bits_t;
extern volatile __OFF046bits_t OFF046bits ;//__asm__ ("OFF046") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF047 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF047bits_t;
extern volatile __OFF047bits_t OFF047bits ;//__asm__ ("OFF047") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF048 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF048bits_t;
extern volatile __OFF048bits_t OFF048bits ;//__asm__ ("OFF048") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF049 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF049bits_t;
extern volatile __OFF049bits_t OFF049bits ;//__asm__ ("OFF049") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF050 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF050bits_t;
extern volatile __OFF050bits_t OFF050bits ;//__asm__ ("OFF050") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF051 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF051bits_t;
extern volatile __OFF051bits_t OFF051bits ;//__asm__ ("OFF051") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF052 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF052bits_t;
extern volatile __OFF052bits_t OFF052bits ;//__asm__ ("OFF052") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF053 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF053bits_t;
extern volatile __OFF053bits_t OFF053bits ;//__asm__ ("OFF053") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF054 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF054bits_t;
extern volatile __OFF054bits_t OFF054bits ;//__asm__ ("OFF054") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF055 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF055bits_t;
extern volatile __OFF055bits_t OFF055bits ;//__asm__ ("OFF055") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF056 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF056bits_t;
extern volatile __OFF056bits_t OFF056bits ;//__asm__ ("OFF056") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF057 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF057bits_t;
extern volatile __OFF057bits_t OFF057bits ;//__asm__ ("OFF057") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF058 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF058bits_t;
extern volatile __OFF058bits_t OFF058bits ;//__asm__ ("OFF058") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF059 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF059bits_t;
extern volatile __OFF059bits_t OFF059bits ;//__asm__ ("OFF059") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF060 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF060bits_t;
extern volatile __OFF060bits_t OFF060bits ;//__asm__ ("OFF060") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF061 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF061bits_t;
extern volatile __OFF061bits_t OFF061bits ;//__asm__ ("OFF061") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF062 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF062bits_t;
extern volatile __OFF062bits_t OFF062bits ;//__asm__ ("OFF062") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF063 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF063bits_t;
extern volatile __OFF063bits_t OFF063bits ;//__asm__ ("OFF063") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF064 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF064bits_t;
extern volatile __OFF064bits_t OFF064bits ;//__asm__ ("OFF064") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF065 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF065bits_t;
extern volatile __OFF065bits_t OFF065bits ;//__asm__ ("OFF065") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF066 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF066bits_t;
extern volatile __OFF066bits_t OFF066bits ;//__asm__ ("OFF066") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF067 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF067bits_t;
extern volatile __OFF067bits_t OFF067bits ;//__asm__ ("OFF067") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF068 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF068bits_t;
extern volatile __OFF068bits_t OFF068bits ;//__asm__ ("OFF068") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF069 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF069bits_t;
extern volatile __OFF069bits_t OFF069bits ;//__asm__ ("OFF069") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF070 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF070bits_t;
extern volatile __OFF070bits_t OFF070bits ;//__asm__ ("OFF070") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF071 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF071bits_t;
extern volatile __OFF071bits_t OFF071bits ;//__asm__ ("OFF071") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF072 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF072bits_t;
