HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.h
extern volatile __OFF072bits_t OFF072bits ;//__asm__ ("OFF072") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF073 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF073bits_t;
extern volatile __OFF073bits_t OFF073bits ;//__asm__ ("OFF073") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF074 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF074bits_t;
extern volatile __OFF074bits_t OFF074bits ;//__asm__ ("OFF074") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF075 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF075bits_t;
extern volatile __OFF075bits_t OFF075bits ;//__asm__ ("OFF075") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF076 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF076bits_t;
extern volatile __OFF076bits_t OFF076bits ;//__asm__ ("OFF076") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF077 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF077bits_t;
extern volatile __OFF077bits_t OFF077bits ;//__asm__ ("OFF077") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF078 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF078bits_t;
extern volatile __OFF078bits_t OFF078bits ;//__asm__ ("OFF078") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF079 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF079bits_t;
extern volatile __OFF079bits_t OFF079bits ;//__asm__ ("OFF079") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF080 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF080bits_t;
extern volatile __OFF080bits_t OFF080bits ;//__asm__ ("OFF080") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF081 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF081bits_t;
extern volatile __OFF081bits_t OFF081bits ;//__asm__ ("OFF081") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF082 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF082bits_t;
extern volatile __OFF082bits_t OFF082bits ;//__asm__ ("OFF082") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF083 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF083bits_t;
extern volatile __OFF083bits_t OFF083bits ;//__asm__ ("OFF083") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF084 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF084bits_t;
extern volatile __OFF084bits_t OFF084bits ;//__asm__ ("OFF084") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF085 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF085bits_t;
extern volatile __OFF085bits_t OFF085bits ;//__asm__ ("OFF085") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF086 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF086bits_t;
extern volatile __OFF086bits_t OFF086bits ;//__asm__ ("OFF086") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF087 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF087bits_t;
extern volatile __OFF087bits_t OFF087bits ;//__asm__ ("OFF087") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF088 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF088bits_t;
extern volatile __OFF088bits_t OFF088bits ;//__asm__ ("OFF088") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF089 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF089bits_t;
extern volatile __OFF089bits_t OFF089bits ;//__asm__ ("OFF089") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF090 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF090bits_t;
extern volatile __OFF090bits_t OFF090bits ;//__asm__ ("OFF090") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF091 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF091bits_t;
extern volatile __OFF091bits_t OFF091bits ;//__asm__ ("OFF091") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF092 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF092bits_t;
extern volatile __OFF092bits_t OFF092bits ;//__asm__ ("OFF092") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF093 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF093bits_t;
extern volatile __OFF093bits_t OFF093bits ;//__asm__ ("OFF093") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF102 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF102bits_t;
extern volatile __OFF102bits_t OFF102bits ;//__asm__ ("OFF102") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF103 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF103bits_t;
extern volatile __OFF103bits_t OFF103bits ;//__asm__ ("OFF103") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF104 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF104bits_t;
extern volatile __OFF104bits_t OFF104bits ;//__asm__ ("OFF104") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF105 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF105bits_t;
extern volatile __OFF105bits_t OFF105bits ;//__asm__ ("OFF105") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF106 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF106bits_t;
extern volatile __OFF106bits_t OFF106bits ;//__asm__ ("OFF106") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF109 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF109bits_t;
extern volatile __OFF109bits_t OFF109bits ;//__asm__ ("OFF109") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF110 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF110bits_t;
extern volatile __OFF110bits_t OFF110bits ;//__asm__ ("OFF110") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF111 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF111bits_t;
extern volatile __OFF111bits_t OFF111bits ;//__asm__ ("OFF111") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF112 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF112bits_t;
extern volatile __OFF112bits_t OFF112bits ;//__asm__ ("OFF112") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF113 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF113bits_t;
extern volatile __OFF113bits_t OFF113bits ;//__asm__ ("OFF113") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF114 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF114bits_t;
extern volatile __OFF114bits_t OFF114bits ;//__asm__ ("OFF114") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF115 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF115bits_t;
extern volatile __OFF115bits_t OFF115bits ;//__asm__ ("OFF115") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF116 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF116bits_t;
