HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.h
extern volatile __OFF144bits_t OFF144bits ;//__asm__ ("OFF144") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF145 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF145bits_t;
extern volatile __OFF145bits_t OFF145bits ;//__asm__ ("OFF145") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF146 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF146bits_t;
extern volatile __OFF146bits_t OFF146bits ;//__asm__ ("OFF146") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF147 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF147bits_t;
extern volatile __OFF147bits_t OFF147bits ;//__asm__ ("OFF147") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF148 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF148bits_t;
extern volatile __OFF148bits_t OFF148bits ;//__asm__ ("OFF148") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF149 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF149bits_t;
extern volatile __OFF149bits_t OFF149bits ;//__asm__ ("OFF149") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF150 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF150bits_t;
extern volatile __OFF150bits_t OFF150bits ;//__asm__ ("OFF150") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF153 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF153bits_t;
extern volatile __OFF153bits_t OFF153bits ;//__asm__ ("OFF153") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF154 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF154bits_t;
extern volatile __OFF154bits_t OFF154bits ;//__asm__ ("OFF154") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF155 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF155bits_t;
extern volatile __OFF155bits_t OFF155bits ;//__asm__ ("OFF155") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF156 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF156bits_t;
extern volatile __OFF156bits_t OFF156bits ;//__asm__ ("OFF156") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF157 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF157bits_t;
extern volatile __OFF157bits_t OFF157bits ;//__asm__ ("OFF157") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF158 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF158bits_t;
extern volatile __OFF158bits_t OFF158bits ;//__asm__ ("OFF158") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF159 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF159bits_t;
extern volatile __OFF159bits_t OFF159bits ;//__asm__ ("OFF159") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF160 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF160bits_t;
extern volatile __OFF160bits_t OFF160bits ;//__asm__ ("OFF160") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF161 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF161bits_t;
extern volatile __OFF161bits_t OFF161bits ;//__asm__ ("OFF161") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF162 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF162bits_t;
extern volatile __OFF162bits_t OFF162bits ;//__asm__ ("OFF162") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF163 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF163bits_t;
extern volatile __OFF163bits_t OFF163bits ;//__asm__ ("OFF163") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF164 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF164bits_t;
extern volatile __OFF164bits_t OFF164bits ;//__asm__ ("OFF164") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF165 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF165bits_t;
extern volatile __OFF165bits_t OFF165bits ;//__asm__ ("OFF165") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF166 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF166bits_t;
extern volatile __OFF166bits_t OFF166bits ;//__asm__ ("OFF166") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF167 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF167bits_t;
extern volatile __OFF167bits_t OFF167bits ;//__asm__ ("OFF167") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF168 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF168bits_t;
extern volatile __OFF168bits_t OFF168bits ;//__asm__ ("OFF168") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF169 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF169bits_t;
extern volatile __OFF169bits_t OFF169bits ;//__asm__ ("OFF169") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF170 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF170bits_t;
extern volatile __OFF170bits_t OFF170bits ;//__asm__ ("OFF170") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF171 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF171bits_t;
extern volatile __OFF171bits_t OFF171bits ;//__asm__ ("OFF171") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF172 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF172bits_t;
