HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.h
extern volatile __OFF172bits_t OFF172bits ;//__asm__ ("OFF172") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF173 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF173bits_t;
extern volatile __OFF173bits_t OFF173bits ;//__asm__ ("OFF173") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF174 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF174bits_t;
extern volatile __OFF174bits_t OFF174bits ;//__asm__ ("OFF174") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF175 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF175bits_t;
extern volatile __OFF175bits_t OFF175bits ;//__asm__ ("OFF175") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF176 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF176bits_t;
extern volatile __OFF176bits_t OFF176bits ;//__asm__ ("OFF176") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF177 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF177bits_t;
extern volatile __OFF177bits_t OFF177bits ;//__asm__ ("OFF177") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF178 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF178bits_t;
extern volatile __OFF178bits_t OFF178bits ;//__asm__ ("OFF178") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF179 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF179bits_t;
extern volatile __OFF179bits_t OFF179bits ;//__asm__ ("OFF179") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF180 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF180bits_t;
extern volatile __OFF180bits_t OFF180bits ;//__asm__ ("OFF180") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF181 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF181bits_t;
extern volatile __OFF181bits_t OFF181bits ;//__asm__ ("OFF181") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF182 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF182bits_t;
extern volatile __OFF182bits_t OFF182bits ;//__asm__ ("OFF182") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF183 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF183bits_t;
extern volatile __OFF183bits_t OFF183bits ;//__asm__ ("OFF183") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF184 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF184bits_t;
extern volatile __OFF184bits_t OFF184bits ;//__asm__ ("OFF184") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF185 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF185bits_t;
extern volatile __OFF185bits_t OFF185bits ;//__asm__ ("OFF185") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF186 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF186bits_t;
extern volatile __OFF186bits_t OFF186bits ;//__asm__ ("OFF186") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF187 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF187bits_t;
extern volatile __OFF187bits_t OFF187bits ;//__asm__ ("OFF187") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF188 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF188bits_t;
extern volatile __OFF188bits_t OFF188bits ;//__asm__ ("OFF188") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF189 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF189bits_t;
extern volatile __OFF189bits_t OFF189bits ;//__asm__ ("OFF189") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF190 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF190bits_t;
extern volatile __OFF190bits_t OFF190bits ;//__asm__ ("OFF190") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF192 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF192bits_t;
extern volatile __OFF192bits_t OFF192bits ;//__asm__ ("OFF192") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF193 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF193bits_t;
extern volatile __OFF193bits_t OFF193bits ;//__asm__ ("OFF193") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF194 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF194bits_t;
extern volatile __OFF194bits_t OFF194bits ;//__asm__ ("OFF194") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF196 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF196bits_t;
extern volatile __OFF196bits_t OFF196bits ;//__asm__ ("OFF196") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF198 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF198bits_t;
extern volatile __OFF198bits_t OFF198bits ;//__asm__ ("OFF198") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF199 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF199bits_t;
extern volatile __OFF199bits_t OFF199bits ;//__asm__ ("OFF199") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF200 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF200bits_t;
