HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.h
extern volatile __OFF200bits_t OFF200bits ;//__asm__ ("OFF200") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF201 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF201bits_t;
extern volatile __OFF201bits_t OFF201bits ;//__asm__ ("OFF201") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF202 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF202bits_t;
extern volatile __OFF202bits_t OFF202bits ;//__asm__ ("OFF202") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF205 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF205bits_t;
extern volatile __OFF205bits_t OFF205bits ;//__asm__ ("OFF205") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF206 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF206bits_t;
extern volatile __OFF206bits_t OFF206bits ;//__asm__ ("OFF206") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF207 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF207bits_t;
extern volatile __OFF207bits_t OFF207bits ;//__asm__ ("OFF207") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF208 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF208bits_t;
extern volatile __OFF208bits_t OFF208bits ;//__asm__ ("OFF208") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF209 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF209bits_t;
extern volatile __OFF209bits_t OFF209bits ;//__asm__ ("OFF209") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF210 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF210bits_t;
extern volatile __OFF210bits_t OFF210bits ;//__asm__ ("OFF210") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        OFF213 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF213bits_t;
extern volatile __OFF213bits_t OFF213bits ;//__asm__ ("OFF213") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DMACON ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :11;
  unsigned DMABUSY:1;
  unsigned SUSPEND:1;
  unsigned :2;
  unsigned ON:1;
} __DMACONbits_t;
extern volatile __DMACONbits_t DMACONbits ;//__asm__ ("DMACON") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DMACONCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DMACONSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DMACONINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DMASTAT ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned DMACH:3;
  unsigned :28;
  unsigned RDWR:1;
} __DMASTATbits_t;
extern volatile __DMASTATbits_t DMASTATbits ;//__asm__ ("DMASTAT") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DMASTATCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DMASTATSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DMASTATINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DMAADDR ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned DMAADDR:32;
} __DMAADDRbits_t;
extern volatile __DMAADDRbits_t DMAADDRbits ;//__asm__ ("DMAADDR") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DMAADDRCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DMAADDRSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DMAADDRINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCRCCON ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CRCCH:3;
  unsigned :2;
  unsigned CRCTYP:1;
  unsigned CRCAPP:1;
  unsigned CRCEN:1;
  unsigned PLEN:5;
  unsigned :11;
  unsigned BITO:1;
  unsigned :2;
  unsigned WBO:1;
  unsigned BYTO:2;
} __DCRCCONbits_t;
extern volatile __DCRCCONbits_t DCRCCONbits ;//__asm__ ("DCRCCON") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCRCCONCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCRCCONSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCRCCONINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCRCDATA ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned DCRCDATA:32;
} __DCRCDATAbits_t;
extern volatile __DCRCDATAbits_t DCRCDATAbits ;//__asm__ ("DCRCDATA") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCRCDATACLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCRCDATASET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCRCDATAINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCRCXOR ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned DCRCXOR:32;
} __DCRCXORbits_t;
extern volatile __DCRCXORbits_t DCRCXORbits ;//__asm__ ("DCRCXOR") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCRCXORCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCRCXORSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCRCXORINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH0CON ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CHPRI:2;
  unsigned CHEDET:1;
  unsigned :1;
  unsigned CHAEN:1;
  unsigned CHCHN:1;
  unsigned CHAED:1;
  unsigned CHEN:1;
  unsigned CHCHNS:1;
  unsigned :2;
  unsigned CHPATLEN:1;
  unsigned :1;
  unsigned CHPIGNEN:1;
  unsigned :1;
  unsigned CHBUSY:1;
  unsigned :8;
  unsigned CHPIGN:8;
} __DCH0CONbits_t;
extern volatile __DCH0CONbits_t DCH0CONbits ;//__asm__ ("DCH0CON") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH0CONCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH0CONSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH0CONINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH0ECON ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :3;
  unsigned AIRQEN:1;
  unsigned SIRQEN:1;
  unsigned PATEN:1;
  unsigned CABORT:1;
  unsigned CFORCE:1;
  unsigned CHSIRQ:8;
  unsigned CHAIRQ:8;
} __DCH0ECONbits_t;
extern volatile __DCH0ECONbits_t DCH0ECONbits ;//__asm__ ("DCH0ECON") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH0ECONCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH0ECONSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH0ECONINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH0INT ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CHERIF:1;
  unsigned CHTAIF:1;
  unsigned CHCCIF:1;
  unsigned CHBCIF:1;
  unsigned CHDHIF:1;
  unsigned CHDDIF:1;
  unsigned CHSHIF:1;
  unsigned CHSDIF:1;
  unsigned :8;
  unsigned CHERIE:1;
  unsigned CHTAIE:1;
  unsigned CHCCIE:1;
  unsigned CHBCIE:1;
  unsigned CHDHIE:1;
  unsigned CHDDIE:1;
  unsigned CHSHIE:1;
  unsigned CHSDIE:1;
} __DCH0INTbits_t;
