HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.h
extern volatile __DCH0INTbits_t DCH0INTbits ;//__asm__ ("DCH0INT") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH0INTCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH0INTSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH0INTINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH0SSA ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CHSSA:32;
} __DCH0SSAbits_t;
extern volatile __DCH0SSAbits_t DCH0SSAbits ;//__asm__ ("DCH0SSA") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH0SSACLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH0SSASET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH0SSAINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH0DSA ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CHDSA:32;
} __DCH0DSAbits_t;
extern volatile __DCH0DSAbits_t DCH0DSAbits ;//__asm__ ("DCH0DSA") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH0DSACLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH0DSASET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH0DSAINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH0SSIZ ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CHSSIZ:16;
} __DCH0SSIZbits_t;
extern volatile __DCH0SSIZbits_t DCH0SSIZbits ;//__asm__ ("DCH0SSIZ") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH0SSIZCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH0SSIZSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH0SSIZINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH0DSIZ ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CHDSIZ:16;
} __DCH0DSIZbits_t;
extern volatile __DCH0DSIZbits_t DCH0DSIZbits ;//__asm__ ("DCH0DSIZ") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH0DSIZCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH0DSIZSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH0DSIZINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH0SPTR ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CHSPTR:16;
} __DCH0SPTRbits_t;
extern volatile __DCH0SPTRbits_t DCH0SPTRbits ;//__asm__ ("DCH0SPTR") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH0SPTRCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH0SPTRSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH0SPTRINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH0DPTR ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CHDPTR:16;
} __DCH0DPTRbits_t;
extern volatile __DCH0DPTRbits_t DCH0DPTRbits ;//__asm__ ("DCH0DPTR") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH0DPTRCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH0DPTRSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH0DPTRINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH0CSIZ ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CHCSIZ:16;
} __DCH0CSIZbits_t;
extern volatile __DCH0CSIZbits_t DCH0CSIZbits ;//__asm__ ("DCH0CSIZ") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH0CSIZCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH0CSIZSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH0CSIZINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH0CPTR ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CHCPTR:16;
} __DCH0CPTRbits_t;
extern volatile __DCH0CPTRbits_t DCH0CPTRbits ;//__asm__ ("DCH0CPTR") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCS0CPTR ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CHCPTR:16;
} __DCS0CPTRbits_t;
extern volatile __DCS0CPTRbits_t DCS0CPTRbits ;//__asm__ ("DCS0CPTR") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH0CPTRCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCS0CPTRCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH0CPTRSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCS0CPTRSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH0CPTRINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCS0CPTRINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH0DAT ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CHPDAT:16;
} __DCH0DATbits_t;
extern volatile __DCH0DATbits_t DCH0DATbits ;//__asm__ ("DCH0DAT") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH0DATCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH0DATSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH0DATINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH1CON ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CHPRI:2;
  unsigned CHEDET:1;
  unsigned :1;
  unsigned CHAEN:1;
  unsigned CHCHN:1;
  unsigned CHAED:1;
  unsigned CHEN:1;
  unsigned CHCHNS:1;
  unsigned :2;
  unsigned CHPATLEN:1;
  unsigned :1;
  unsigned CHPIGNEN:1;
  unsigned :1;
  unsigned CHBUSY:1;
  unsigned :8;
  unsigned CHPIGN:8;
} __DCH1CONbits_t;
extern volatile __DCH1CONbits_t DCH1CONbits ;//__asm__ ("DCH1CON") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH1CONCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH1CONSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH1CONINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH1ECON ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :3;
  unsigned AIRQEN:1;
  unsigned SIRQEN:1;
  unsigned PATEN:1;
  unsigned CABORT:1;
  unsigned CFORCE:1;
  unsigned CHSIRQ:8;
  unsigned CHAIRQ:8;
} __DCH1ECONbits_t;
extern volatile __DCH1ECONbits_t DCH1ECONbits ;//__asm__ ("DCH1ECON") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH1ECONCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH1ECONSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH1ECONINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH1INT ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CHERIF:1;
  unsigned CHTAIF:1;
  unsigned CHCCIF:1;
  unsigned CHBCIF:1;
  unsigned CHDHIF:1;
  unsigned CHDDIF:1;
  unsigned CHSHIF:1;
  unsigned CHSDIF:1;
  unsigned :8;
  unsigned CHERIE:1;
  unsigned CHTAIE:1;
  unsigned CHCCIE:1;
  unsigned CHBCIE:1;
  unsigned CHDHIE:1;
  unsigned CHDDIE:1;
  unsigned CHSHIE:1;
  unsigned CHSDIE:1;
} __DCH1INTbits_t;
