HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.h
extern volatile __DCH4SSIZbits_t DCH4SSIZbits ;//__asm__ ("DCH4SSIZ") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH4SSIZCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH4SSIZSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH4SSIZINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH4DSIZ ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CHDSIZ:16;
} __DCH4DSIZbits_t;
extern volatile __DCH4DSIZbits_t DCH4DSIZbits ;//__asm__ ("DCH4DSIZ") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH4DSIZCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH4DSIZSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH4DSIZINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH4SPTR ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CHSPTR:16;
} __DCH4SPTRbits_t;
extern volatile __DCH4SPTRbits_t DCH4SPTRbits ;//__asm__ ("DCH4SPTR") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH4SPTRCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH4SPTRSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH4SPTRINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH4DPTR ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CHDPTR:16;
} __DCH4DPTRbits_t;
extern volatile __DCH4DPTRbits_t DCH4DPTRbits ;//__asm__ ("DCH4DPTR") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH4DPTRCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH4DPTRSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH4DPTRINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH4CSIZ ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CHCSIZ:16;
} __DCH4CSIZbits_t;
extern volatile __DCH4CSIZbits_t DCH4CSIZbits ;//__asm__ ("DCH4CSIZ") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH4CSIZCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH4CSIZSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH4CSIZINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH4CPTR ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CHCPTR:16;
} __DCH4CPTRbits_t;
extern volatile __DCH4CPTRbits_t DCH4CPTRbits ;//__asm__ ("DCH4CPTR") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCS4CPTR ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CHCPTR:16;
} __DCS4CPTRbits_t;
extern volatile __DCS4CPTRbits_t DCS4CPTRbits ;//__asm__ ("DCS4CPTR") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH4CPTRCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCS4CPTRCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH4CPTRSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCS4CPTRSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH4CPTRINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCS4CPTRINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH4DAT ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CHPDAT:16;
} __DCH4DATbits_t;
extern volatile __DCH4DATbits_t DCH4DATbits ;//__asm__ ("DCH4DAT") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH4DATCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH4DATSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH4DATINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH5CON ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CHPRI:2;
  unsigned CHEDET:1;
  unsigned :1;
  unsigned CHAEN:1;
  unsigned CHCHN:1;
  unsigned CHAED:1;
  unsigned CHEN:1;
  unsigned CHCHNS:1;
  unsigned :2;
  unsigned CHPATLEN:1;
  unsigned :1;
  unsigned CHPIGNEN:1;
  unsigned :1;
  unsigned CHBUSY:1;
  unsigned :8;
  unsigned CHPIGN:8;
} __DCH5CONbits_t;
extern volatile __DCH5CONbits_t DCH5CONbits ;//__asm__ ("DCH5CON") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH5CONCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH5CONSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH5CONINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH5ECON ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :3;
  unsigned AIRQEN:1;
  unsigned SIRQEN:1;
  unsigned PATEN:1;
  unsigned CABORT:1;
  unsigned CFORCE:1;
  unsigned CHSIRQ:8;
  unsigned CHAIRQ:8;
} __DCH5ECONbits_t;
extern volatile __DCH5ECONbits_t DCH5ECONbits ;//__asm__ ("DCH5ECON") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH5ECONCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH5ECONSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH5ECONINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH5INT ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CHERIF:1;
  unsigned CHTAIF:1;
  unsigned CHCCIF:1;
  unsigned CHBCIF:1;
  unsigned CHDHIF:1;
  unsigned CHDDIF:1;
  unsigned CHSHIF:1;
  unsigned CHSDIF:1;
  unsigned :8;
  unsigned CHERIE:1;
  unsigned CHTAIE:1;
  unsigned CHCCIE:1;
  unsigned CHBCIE:1;
  unsigned CHDHIE:1;
  unsigned CHDDIE:1;
  unsigned CHSHIE:1;
  unsigned CHSDIE:1;
} __DCH5INTbits_t;
extern volatile __DCH5INTbits_t DCH5INTbits ;//__asm__ ("DCH5INT") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH5INTCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH5INTSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH5INTINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH5SSA ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CHSSA:32;
} __DCH5SSAbits_t;
extern volatile __DCH5SSAbits_t DCH5SSAbits ;//__asm__ ("DCH5SSA") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH5SSACLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH5SSASET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH5SSAINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH5DSA ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CHDSA:32;
} __DCH5DSAbits_t;
extern volatile __DCH5DSAbits_t DCH5DSAbits ;//__asm__ ("DCH5DSA") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH5DSACLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH5DSASET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH5DSAINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH5SSIZ ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CHSSIZ:16;
} __DCH5SSIZbits_t;
