HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.h
extern volatile __DCH5SSIZbits_t DCH5SSIZbits ;//__asm__ ("DCH5SSIZ") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH5SSIZCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH5SSIZSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH5SSIZINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH5DSIZ ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CHDSIZ:16;
} __DCH5DSIZbits_t;
extern volatile __DCH5DSIZbits_t DCH5DSIZbits ;//__asm__ ("DCH5DSIZ") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH5DSIZCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH5DSIZSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH5DSIZINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH5SPTR ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CHSPTR:16;
} __DCH5SPTRbits_t;
extern volatile __DCH5SPTRbits_t DCH5SPTRbits ;//__asm__ ("DCH5SPTR") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH5SPTRCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH5SPTRSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH5SPTRINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH5DPTR ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CHDPTR:16;
} __DCH5DPTRbits_t;
extern volatile __DCH5DPTRbits_t DCH5DPTRbits ;//__asm__ ("DCH5DPTR") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH5DPTRCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH5DPTRSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH5DPTRINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH5CSIZ ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CHCSIZ:16;
} __DCH5CSIZbits_t;
extern volatile __DCH5CSIZbits_t DCH5CSIZbits ;//__asm__ ("DCH5CSIZ") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH5CSIZCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH5CSIZSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH5CSIZINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH5CPTR ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CHCPTR:16;
} __DCH5CPTRbits_t;
extern volatile __DCH5CPTRbits_t DCH5CPTRbits ;//__asm__ ("DCH5CPTR") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCS5CPTR ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CHCPTR:16;
} __DCS5CPTRbits_t;
extern volatile __DCS5CPTRbits_t DCS5CPTRbits ;//__asm__ ("DCS5CPTR") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH5CPTRCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCS5CPTRCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH5CPTRSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCS5CPTRSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH5CPTRINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCS5CPTRINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH5DAT ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CHPDAT:16;
} __DCH5DATbits_t;
extern volatile __DCH5DATbits_t DCH5DATbits ;//__asm__ ("DCH5DAT") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH5DATCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH5DATSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH5DATINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH6CON ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CHPRI:2;
  unsigned CHEDET:1;
  unsigned :1;
  unsigned CHAEN:1;
  unsigned CHCHN:1;
  unsigned CHAED:1;
  unsigned CHEN:1;
  unsigned CHCHNS:1;
  unsigned :2;
  unsigned CHPATLEN:1;
  unsigned :1;
  unsigned CHPIGNEN:1;
  unsigned :1;
  unsigned CHBUSY:1;
  unsigned :8;
  unsigned CHPIGN:8;
} __DCH6CONbits_t;
extern volatile __DCH6CONbits_t DCH6CONbits ;//__asm__ ("DCH6CON") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH6CONCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH6CONSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH6CONINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH6ECON ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :3;
  unsigned AIRQEN:1;
  unsigned SIRQEN:1;
  unsigned PATEN:1;
  unsigned CABORT:1;
  unsigned CFORCE:1;
  unsigned CHSIRQ:8;
  unsigned CHAIRQ:8;
} __DCH6ECONbits_t;
extern volatile __DCH6ECONbits_t DCH6ECONbits ;//__asm__ ("DCH6ECON") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH6ECONCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH6ECONSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH6ECONINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH6INT ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CHERIF:1;
  unsigned CHTAIF:1;
  unsigned CHCCIF:1;
  unsigned CHBCIF:1;
  unsigned CHDHIF:1;
  unsigned CHDDIF:1;
  unsigned CHSHIF:1;
  unsigned CHSDIF:1;
  unsigned :8;
  unsigned CHERIE:1;
  unsigned CHTAIE:1;
  unsigned CHCCIE:1;
  unsigned CHBCIE:1;
  unsigned CHDHIE:1;
  unsigned CHDDIE:1;
  unsigned CHSHIE:1;
  unsigned CHSDIE:1;
} __DCH6INTbits_t;
extern volatile __DCH6INTbits_t DCH6INTbits ;//__asm__ ("DCH6INT") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH6INTCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH6INTSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH6INTINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH6SSA ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CHSSA:32;
} __DCH6SSAbits_t;
