HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.h
extern volatile __DCH6SSAbits_t DCH6SSAbits ;//__asm__ ("DCH6SSA") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH6SSACLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH6SSASET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH6SSAINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH6DSA ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CHDSA:32;
} __DCH6DSAbits_t;
extern volatile __DCH6DSAbits_t DCH6DSAbits ;//__asm__ ("DCH6DSA") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH6DSACLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH6DSASET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH6DSAINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH6SSIZ ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CHSSIZ:16;
} __DCH6SSIZbits_t;
extern volatile __DCH6SSIZbits_t DCH6SSIZbits ;//__asm__ ("DCH6SSIZ") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH6SSIZCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH6SSIZSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH6SSIZINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH6DSIZ ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CHDSIZ:16;
} __DCH6DSIZbits_t;
extern volatile __DCH6DSIZbits_t DCH6DSIZbits ;//__asm__ ("DCH6DSIZ") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH6DSIZCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH6DSIZSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH6DSIZINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH6SPTR ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CHSPTR:16;
} __DCH6SPTRbits_t;
extern volatile __DCH6SPTRbits_t DCH6SPTRbits ;//__asm__ ("DCH6SPTR") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH6SPTRCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH6SPTRSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH6SPTRINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH6DPTR ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CHDPTR:16;
} __DCH6DPTRbits_t;
extern volatile __DCH6DPTRbits_t DCH6DPTRbits ;//__asm__ ("DCH6DPTR") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH6DPTRCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH6DPTRSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH6DPTRINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH6CSIZ ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CHCSIZ:16;
} __DCH6CSIZbits_t;
extern volatile __DCH6CSIZbits_t DCH6CSIZbits ;//__asm__ ("DCH6CSIZ") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH6CSIZCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH6CSIZSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH6CSIZINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH6CPTR ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CHCPTR:16;
} __DCH6CPTRbits_t;
extern volatile __DCH6CPTRbits_t DCH6CPTRbits ;//__asm__ ("DCH6CPTR") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCS6CPTR ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CHCPTR:16;
} __DCS6CPTRbits_t;
extern volatile __DCS6CPTRbits_t DCS6CPTRbits ;//__asm__ ("DCS6CPTR") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH6CPTRCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCS6CPTRCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH6CPTRSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCS6CPTRSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH6CPTRINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCS6CPTRINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH6DAT ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CHPDAT:16;
} __DCH6DATbits_t;
extern volatile __DCH6DATbits_t DCH6DATbits ;//__asm__ ("DCH6DAT") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH6DATCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH6DATSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH6DATINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH7CON ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CHPRI:2;
  unsigned CHEDET:1;
  unsigned :1;
  unsigned CHAEN:1;
  unsigned CHCHN:1;
  unsigned CHAED:1;
  unsigned CHEN:1;
  unsigned CHCHNS:1;
  unsigned :2;
  unsigned CHPATLEN:1;
  unsigned :1;
  unsigned CHPIGNEN:1;
  unsigned :1;
  unsigned CHBUSY:1;
  unsigned :8;
  unsigned CHPIGN:8;
} __DCH7CONbits_t;
extern volatile __DCH7CONbits_t DCH7CONbits ;//__asm__ ("DCH7CON") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH7CONCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH7CONSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH7CONINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH7ECON ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :3;
  unsigned AIRQEN:1;
  unsigned SIRQEN:1;
  unsigned PATEN:1;
  unsigned CABORT:1;
  unsigned CFORCE:1;
  unsigned CHSIRQ:8;
  unsigned CHAIRQ:8;
} __DCH7ECONbits_t;
extern volatile __DCH7ECONbits_t DCH7ECONbits ;//__asm__ ("DCH7ECON") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH7ECONCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH7ECONSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH7ECONINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH7INT ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CHERIF:1;
  unsigned CHTAIF:1;
  unsigned CHCCIF:1;
  unsigned CHBCIF:1;
  unsigned CHDHIF:1;
  unsigned CHDDIF:1;
  unsigned CHSHIF:1;
  unsigned CHSDIF:1;
  unsigned :8;
  unsigned CHERIE:1;
  unsigned CHTAIE:1;
  unsigned CHCCIE:1;
  unsigned CHBCIE:1;
  unsigned CHDHIE:1;
  unsigned CHDDIE:1;
  unsigned CHSHIE:1;
  unsigned CHSDIE:1;
} __DCH7INTbits_t;
extern volatile __DCH7INTbits_t DCH7INTbits ;//__asm__ ("DCH7INT") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH7INTCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH7INTSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH7INTINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        DCH7SSA ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CHSSA:32;
} __DCH7SSAbits_t;
