HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.h
extern volatile __PMMODEbits_t PMMODEbits ;//__asm__ ("PMMODE") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PMMODECLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PMMODESET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PMMODEINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PMADDR ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned ADDR:14;
    unsigned ADDR14:1;
    unsigned ADDR15:1;
  };
  struct {
    unsigned :14;
    unsigned CS:2;
  };
  struct {
    unsigned :14;
    unsigned CS1:1;
    unsigned CS2:1;
  };
  struct {
    unsigned w:32;
  };
} __PMADDRbits_t;
extern volatile __PMADDRbits_t PMADDRbits ;//__asm__ ("PMADDR") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PMADDRCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PMADDRSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PMADDRINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PMDOUT ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned DATAOUT:32;
  };
  struct {
    unsigned w:32;
  };
} __PMDOUTbits_t;
extern volatile __PMDOUTbits_t PMDOUTbits ;//__asm__ ("PMDOUT") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PMDOUTCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PMDOUTSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PMDOUTINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PMDIN ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned DATAIN:32;
  };
  struct {
    unsigned w:32;
  };
} __PMDINbits_t;
extern volatile __PMDINbits_t PMDINbits ;//__asm__ ("PMDIN") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PMDINCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PMDINSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PMDININV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PMAEN ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned PTEN:24;
  };
  struct {
    unsigned w:32;
  };
} __PMAENbits_t;
extern volatile __PMAENbits_t PMAENbits ;//__asm__ ("PMAEN") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PMAENCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PMAENSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PMAENINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PMSTAT ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned OB0E:1;
    unsigned OB1E:1;
    unsigned OB2E:1;
    unsigned OB3E:1;
    unsigned :2;
    unsigned OBUF:1;
    unsigned OBE:1;
    unsigned IB0F:1;
    unsigned IB1F:1;
    unsigned IB2F:1;
    unsigned IB3F:1;
    unsigned :2;
    unsigned IBOV:1;
    unsigned IBF:1;
  };
  struct {
    unsigned w:32;
  };
} __PMSTATbits_t;
extern volatile __PMSTATbits_t PMSTATbits ;//__asm__ ("PMSTAT") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PMSTATCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PMSTATSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PMSTATINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PMWADDR ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned WADDR:14;
    unsigned WADDR14:1;
    unsigned WADDR15:1;
  };
  struct {
    unsigned :14;
    unsigned WCS:2;
  };
  struct {
    unsigned :14;
    unsigned WCS1:1;
    unsigned WCS2:1;
  };
  struct {
    unsigned w:32;
  };
} __PMWADDRbits_t;
extern volatile __PMWADDRbits_t PMWADDRbits ;//__asm__ ("PMWADDR") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PMWADDRCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PMWADDRSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PMWADDRINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PMRADDR ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned RADDR:14;
    unsigned RADDR14:1;
    unsigned RADDR15:1;
  };
  struct {
    unsigned :14;
    unsigned RCS:2;
  };
  struct {
    unsigned :14;
    unsigned RCS1:1;
    unsigned RCS2:1;
  };
  struct {
    unsigned w:32;
  };
} __PMRADDRbits_t;
extern volatile __PMRADDRbits_t PMRADDRbits ;//__asm__ ("PMRADDR") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PMRADDRCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PMRADDRSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PMRADDRINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PMRDIN ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned RDATAIN:32;
  };
  struct {
    unsigned w:32;
  };
} __PMRDINbits_t;
extern volatile __PMRDINbits_t PMRDINbits ;//__asm__ ("PMRDIN") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PMRDINCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PMRDINSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PMRDININV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        T1CON ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned :1;
    unsigned TCS:1;
    unsigned TSYNC:1;
    unsigned :1;
    unsigned TCKPS:2;
    unsigned :1;
    unsigned TGATE:1;
    unsigned :3;
    unsigned TWIP:1;
    unsigned TWDIS:1;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned :4;
    unsigned TCKPS0:1;
    unsigned TCKPS1:1;
  };
  struct {
    unsigned :13;
    unsigned TSIDL:1;
    unsigned :1;
    unsigned TON:1;
  };
  struct {
    unsigned w:32;
  };
} __T1CONbits_t;
extern volatile __T1CONbits_t T1CONbits ;//__asm__ ("T1CON") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        T1CONCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        T1CONSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        T1CONINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        TMR1 ;//__attribute__((section("sfrs")));
extern volatile unsigned int        TMR1CLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        TMR1SET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        TMR1INV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PR1 ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PR1CLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PR1SET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PR1INV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        T2CON ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned :1;
    unsigned TCS:1;
    unsigned :1;
    unsigned T32:1;
    unsigned TCKPS:3;
    unsigned TGATE:1;
    unsigned :5;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned :4;
    unsigned TCKPS0:1;
    unsigned TCKPS1:1;
    unsigned TCKPS2:1;
  };
  struct {
    unsigned :13;
    unsigned TSIDL:1;
    unsigned :1;
    unsigned TON:1;
  };
  struct {
    unsigned w:32;
  };
} __T2CONbits_t;
