HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.h
extern volatile __IC2CONbits_t IC2CONbits ;//__asm__ ("IC2CON") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IC2CONCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IC2CONSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IC2CONINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IC2BUF ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IC3CON ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned ICM:3;
    unsigned ICBNE:1;
    unsigned ICOV:1;
    unsigned ICI:2;
    unsigned ICTMR:1;
    unsigned C32:1;
    unsigned FEDGE:1;
    unsigned :3;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned ICM0:1;
    unsigned ICM1:1;
    unsigned ICM2:1;
    unsigned :2;
    unsigned ICI0:1;
    unsigned ICI1:1;
  };
  struct {
    unsigned :13;
    unsigned ICSIDL:1;
  };
  struct {
    unsigned w:32;
  };
} __IC3CONbits_t;
extern volatile __IC3CONbits_t IC3CONbits ;//__asm__ ("IC3CON") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IC3CONCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IC3CONSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IC3CONINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IC3BUF ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IC4CON ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned ICM:3;
    unsigned ICBNE:1;
    unsigned ICOV:1;
    unsigned ICI:2;
    unsigned ICTMR:1;
    unsigned C32:1;
    unsigned FEDGE:1;
    unsigned :3;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned ICM0:1;
    unsigned ICM1:1;
    unsigned ICM2:1;
    unsigned :2;
    unsigned ICI0:1;
    unsigned ICI1:1;
  };
  struct {
    unsigned :13;
    unsigned ICSIDL:1;
  };
  struct {
    unsigned w:32;
  };
} __IC4CONbits_t;
extern volatile __IC4CONbits_t IC4CONbits ;//__asm__ ("IC4CON") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IC4CONCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IC4CONSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IC4CONINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IC4BUF ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IC5CON ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned ICM:3;
    unsigned ICBNE:1;
    unsigned ICOV:1;
    unsigned ICI:2;
    unsigned ICTMR:1;
    unsigned C32:1;
    unsigned FEDGE:1;
    unsigned :3;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned ICM0:1;
    unsigned ICM1:1;
    unsigned ICM2:1;
    unsigned :2;
    unsigned ICI0:1;
    unsigned ICI1:1;
  };
  struct {
    unsigned :13;
    unsigned ICSIDL:1;
  };
  struct {
    unsigned w:32;
  };
} __IC5CONbits_t;
extern volatile __IC5CONbits_t IC5CONbits ;//__asm__ ("IC5CON") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IC5CONCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IC5CONSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IC5CONINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IC5BUF ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IC6CON ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned ICM:3;
    unsigned ICBNE:1;
    unsigned ICOV:1;
    unsigned ICI:2;
    unsigned ICTMR:1;
    unsigned C32:1;
    unsigned FEDGE:1;
    unsigned :3;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned ICM0:1;
    unsigned ICM1:1;
    unsigned ICM2:1;
    unsigned :2;
    unsigned ICI0:1;
    unsigned ICI1:1;
  };
  struct {
    unsigned :13;
    unsigned ICSIDL:1;
  };
  struct {
    unsigned w:32;
  };
} __IC6CONbits_t;
extern volatile __IC6CONbits_t IC6CONbits ;//__asm__ ("IC6CON") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IC6CONCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IC6CONSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IC6CONINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IC6BUF ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IC7CON ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned ICM:3;
    unsigned ICBNE:1;
    unsigned ICOV:1;
    unsigned ICI:2;
    unsigned ICTMR:1;
    unsigned C32:1;
    unsigned FEDGE:1;
    unsigned :3;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned ICM0:1;
    unsigned ICM1:1;
    unsigned ICM2:1;
    unsigned :2;
    unsigned ICI0:1;
    unsigned ICI1:1;
  };
  struct {
    unsigned :13;
    unsigned ICSIDL:1;
  };
  struct {
    unsigned w:32;
  };
} __IC7CONbits_t;
extern volatile __IC7CONbits_t IC7CONbits ;//__asm__ ("IC7CON") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IC7CONCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IC7CONSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IC7CONINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IC7BUF ;//__attribute__((section("sfrs")));
extern volatile unsigned int        IC8CON ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned ICM:3;
    unsigned ICBNE:1;
    unsigned ICOV:1;
    unsigned ICI:2;
    unsigned ICTMR:1;
    unsigned C32:1;
    unsigned FEDGE:1;
    unsigned :3;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned ICM0:1;
    unsigned ICM1:1;
    unsigned ICM2:1;
    unsigned :2;
    unsigned ICI0:1;
    unsigned ICI1:1;
  };
  struct {
    unsigned :13;
    unsigned ICSIDL:1;
  };
  struct {
    unsigned w:32;
  };
} __IC8CONbits_t;
