HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.h
extern volatile __ADCSYSCFG1bits_t ADCSYSCFG1bits ;//__asm__ ("ADCSYSCFG1") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ADCDATA0 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __ADCDATA0bits_t;
extern volatile __ADCDATA0bits_t ADCDATA0bits ;//__asm__ ("ADCDATA0") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ADCDATA1 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __ADCDATA1bits_t;
extern volatile __ADCDATA1bits_t ADCDATA1bits ;//__asm__ ("ADCDATA1") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ADCDATA2 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __ADCDATA2bits_t;
extern volatile __ADCDATA2bits_t ADCDATA2bits ;//__asm__ ("ADCDATA2") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ADCDATA3 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __ADCDATA3bits_t;
extern volatile __ADCDATA3bits_t ADCDATA3bits ;//__asm__ ("ADCDATA3") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ADCDATA4 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __ADCDATA4bits_t;
extern volatile __ADCDATA4bits_t ADCDATA4bits ;//__asm__ ("ADCDATA4") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ADCDATA5 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __ADCDATA5bits_t;
extern volatile __ADCDATA5bits_t ADCDATA5bits ;//__asm__ ("ADCDATA5") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ADCDATA6 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __ADCDATA6bits_t;
extern volatile __ADCDATA6bits_t ADCDATA6bits ;//__asm__ ("ADCDATA6") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ADCDATA7 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __ADCDATA7bits_t;
extern volatile __ADCDATA7bits_t ADCDATA7bits ;//__asm__ ("ADCDATA7") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ADCDATA8 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __ADCDATA8bits_t;
extern volatile __ADCDATA8bits_t ADCDATA8bits ;//__asm__ ("ADCDATA8") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ADCDATA9 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __ADCDATA9bits_t;
extern volatile __ADCDATA9bits_t ADCDATA9bits ;//__asm__ ("ADCDATA9") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ADCDATA10 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __ADCDATA10bits_t;
extern volatile __ADCDATA10bits_t ADCDATA10bits ;//__asm__ ("ADCDATA10") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ADCDATA11 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __ADCDATA11bits_t;
extern volatile __ADCDATA11bits_t ADCDATA11bits ;//__asm__ ("ADCDATA11") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ADCDATA12 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __ADCDATA12bits_t;
extern volatile __ADCDATA12bits_t ADCDATA12bits ;//__asm__ ("ADCDATA12") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ADCDATA13 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __ADCDATA13bits_t;
extern volatile __ADCDATA13bits_t ADCDATA13bits ;//__asm__ ("ADCDATA13") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ADCDATA14 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __ADCDATA14bits_t;
extern volatile __ADCDATA14bits_t ADCDATA14bits ;//__asm__ ("ADCDATA14") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ADCDATA15 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __ADCDATA15bits_t;
extern volatile __ADCDATA15bits_t ADCDATA15bits ;//__asm__ ("ADCDATA15") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ADCDATA16 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __ADCDATA16bits_t;
extern volatile __ADCDATA16bits_t ADCDATA16bits ;//__asm__ ("ADCDATA16") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ADCDATA17 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __ADCDATA17bits_t;
extern volatile __ADCDATA17bits_t ADCDATA17bits ;//__asm__ ("ADCDATA17") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ADCDATA18 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __ADCDATA18bits_t;
extern volatile __ADCDATA18bits_t ADCDATA18bits ;//__asm__ ("ADCDATA18") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ADCDATA19 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __ADCDATA19bits_t;
extern volatile __ADCDATA19bits_t ADCDATA19bits ;//__asm__ ("ADCDATA19") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ADCDATA20 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __ADCDATA20bits_t;
extern volatile __ADCDATA20bits_t ADCDATA20bits ;//__asm__ ("ADCDATA20") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ADCDATA21 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __ADCDATA21bits_t;
extern volatile __ADCDATA21bits_t ADCDATA21bits ;//__asm__ ("ADCDATA21") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ADCDATA22 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __ADCDATA22bits_t;
extern volatile __ADCDATA22bits_t ADCDATA22bits ;//__asm__ ("ADCDATA22") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ADCDATA23 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __ADCDATA23bits_t;
extern volatile __ADCDATA23bits_t ADCDATA23bits ;//__asm__ ("ADCDATA23") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ADCDATA24 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __ADCDATA24bits_t;
