HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.h
extern volatile __SRCON1Bbits_t SRCON1Bbits ;//__asm__ ("SRCON1B") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ANSELC ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned :1;
    unsigned ANSC1:1;
    unsigned ANSC2:1;
    unsigned ANSC3:1;
    unsigned ANSC4:1;
  };
  struct {
    unsigned w:32;
  };
} __ANSELCbits_t;
extern volatile __ANSELCbits_t ANSELCbits ;//__asm__ ("ANSELC") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ANSELCCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ANSELCSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ANSELCINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        TRISC ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned :1;
    unsigned TRISC1:1;
    unsigned TRISC2:1;
    unsigned TRISC3:1;
    unsigned TRISC4:1;
    unsigned :7;
    unsigned TRISC12:1;
    unsigned TRISC13:1;
    unsigned TRISC14:1;
    unsigned TRISC15:1;
  };
  struct {
    unsigned w:32;
  };
} __TRISCbits_t;
extern volatile __TRISCbits_t TRISCbits ;//__asm__ ("TRISC") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        TRISCCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        TRISCSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        TRISCINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PORTC ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned :1;
    unsigned RC1:1;
    unsigned RC2:1;
    unsigned RC3:1;
    unsigned RC4:1;
    unsigned :7;
    unsigned RC12:1;
    unsigned RC13:1;
    unsigned RC14:1;
    unsigned RC15:1;
  };
  struct {
    unsigned w:32;
  };
} __PORTCbits_t;
extern volatile __PORTCbits_t PORTCbits ;//__asm__ ("PORTC") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PORTCCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PORTCSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PORTCINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        LATC ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned :1;
    unsigned LATC1:1;
    unsigned LATC2:1;
    unsigned LATC3:1;
    unsigned LATC4:1;
    unsigned :7;
    unsigned LATC12:1;
    unsigned LATC13:1;
    unsigned LATC14:1;
    unsigned LATC15:1;
  };
  struct {
    unsigned w:32;
  };
} __LATCbits_t;
extern volatile __LATCbits_t LATCbits ;//__asm__ ("LATC") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        LATCCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        LATCSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        LATCINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ODCC ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned :1;
    unsigned ODCC1:1;
    unsigned ODCC2:1;
    unsigned ODCC3:1;
    unsigned ODCC4:1;
    unsigned :7;
    unsigned ODCC12:1;
    unsigned ODCC13:1;
    unsigned ODCC14:1;
    unsigned ODCC15:1;
  };
  struct {
    unsigned w:32;
  };
} __ODCCbits_t;
extern volatile __ODCCbits_t ODCCbits ;//__asm__ ("ODCC") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ODCCCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ODCCSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ODCCINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNPUC ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned :1;
    unsigned CNPUC1:1;
    unsigned CNPUC2:1;
    unsigned CNPUC3:1;
    unsigned CNPUC4:1;
    unsigned :7;
    unsigned CNPUC12:1;
    unsigned CNPUC13:1;
    unsigned CNPUC14:1;
    unsigned CNPUC15:1;
  };
  struct {
    unsigned w:32;
  };
} __CNPUCbits_t;
extern volatile __CNPUCbits_t CNPUCbits ;//__asm__ ("CNPUC") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNPUCCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNPUCSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNPUCINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNPDC ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned :1;
    unsigned CNPDC1:1;
    unsigned CNPDC2:1;
    unsigned CNPDC3:1;
    unsigned CNPDC4:1;
    unsigned :7;
    unsigned CNPDC12:1;
    unsigned CNPDC13:1;
    unsigned CNPDC14:1;
    unsigned CNPDC15:1;
  };
  struct {
    unsigned w:32;
  };
} __CNPDCbits_t;
extern volatile __CNPDCbits_t CNPDCbits ;//__asm__ ("CNPDC") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNPDCCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNPDCSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNPDCINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNCONC ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned :11;
    unsigned EDGEDETECT:1;
    unsigned :1;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned w:32;
  };
} __CNCONCbits_t;
extern volatile __CNCONCbits_t CNCONCbits ;//__asm__ ("CNCONC") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNCONCCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNCONCSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNCONCINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNENC ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned :1;
    unsigned CNIEC1:1;
    unsigned CNIEC2:1;
    unsigned CNIEC3:1;
    unsigned CNIEC4:1;
    unsigned :7;
    unsigned CNIEC12:1;
    unsigned CNIEC13:1;
    unsigned CNIEC14:1;
    unsigned CNIEC15:1;
  };
  struct {
    unsigned w:32;
  };
} __CNENCbits_t;
