HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.h
extern volatile __CNENCbits_t CNENCbits ;//__asm__ ("CNENC") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNENCCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNENCSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNENCINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNSTATC ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned :1;
    unsigned CNSTATC1:1;
    unsigned CNSTATC2:1;
    unsigned CNSTATC3:1;
    unsigned CNSTATC4:1;
    unsigned :7;
    unsigned CNSTATC12:1;
    unsigned CNSTATC13:1;
    unsigned CNSTATC14:1;
    unsigned CNSTATC15:1;
  };
  struct {
    unsigned w:32;
  };
} __CNSTATCbits_t;
extern volatile __CNSTATCbits_t CNSTATCbits ;//__asm__ ("CNSTATC") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNSTATCCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNSTATCSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNSTATCINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNNEC ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned CNNEC1:1;
  unsigned CNNEC2:1;
  unsigned CNNEC3:1;
  unsigned CNNEC4:1;
  unsigned :7;
  unsigned CNNEC12:1;
  unsigned CNNEC13:1;
  unsigned CNNEC14:1;
  unsigned CNNEC15:1;
} __CNNECbits_t;
extern volatile __CNNECbits_t CNNECbits ;//__asm__ ("CNNEC") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNFC ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned CNFC1:1;
  unsigned CNFC2:1;
  unsigned CNFC3:1;
  unsigned CNFC4:1;
  unsigned :7;
  unsigned CNFC12:1;
  unsigned CNFC13:1;
  unsigned CNFC14:1;
  unsigned CNFC15:1;
} __CNFCbits_t;
extern volatile __CNFCbits_t CNFCbits ;//__asm__ ("CNFC") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ANSELD ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned :14;
    unsigned ANSD14:1;
    unsigned ANSD15:1;
  };
  struct {
    unsigned w:32;
  };
} __ANSELDbits_t;
extern volatile __ANSELDbits_t ANSELDbits ;//__asm__ ("ANSELD") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ANSELDCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ANSELDSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ANSELDINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        TRISD ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned TRISD0:1;
    unsigned TRISD1:1;
    unsigned TRISD2:1;
    unsigned TRISD3:1;
    unsigned TRISD4:1;
    unsigned TRISD5:1;
    unsigned :3;
    unsigned TRISD9:1;
    unsigned TRISD10:1;
    unsigned TRISD11:1;
    unsigned TRISD12:1;
    unsigned TRISD13:1;
    unsigned TRISD14:1;
    unsigned TRISD15:1;
  };
  struct {
    unsigned w:32;
  };
} __TRISDbits_t;
extern volatile __TRISDbits_t TRISDbits ;//__asm__ ("TRISD") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        TRISDCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        TRISDSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        TRISDINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PORTD ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned RD0:1;
    unsigned RD1:1;
    unsigned RD2:1;
    unsigned RD3:1;
    unsigned RD4:1;
    unsigned RD5:1;
    unsigned :3;
    unsigned RD9:1;
    unsigned RD10:1;
    unsigned RD11:1;
    unsigned RD12:1;
    unsigned RD13:1;
    unsigned RD14:1;
    unsigned RD15:1;
  };
  struct {
    unsigned w:32;
  };
} __PORTDbits_t;
extern volatile __PORTDbits_t PORTDbits ;//__asm__ ("PORTD") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PORTDCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PORTDSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PORTDINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        LATD ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned LATD0:1;
    unsigned LATD1:1;
    unsigned LATD2:1;
    unsigned LATD3:1;
    unsigned LATD4:1;
    unsigned LATD5:1;
    unsigned :3;
    unsigned LATD9:1;
    unsigned LATD10:1;
    unsigned LATD11:1;
    unsigned LATD12:1;
    unsigned LATD13:1;
    unsigned LATD14:1;
    unsigned LATD15:1;
  };
  struct {
    unsigned w:32;
  };
} __LATDbits_t;
extern volatile __LATDbits_t LATDbits ;//__asm__ ("LATD") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        LATDCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        LATDSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        LATDINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ODCD ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned ODCD0:1;
    unsigned ODCD1:1;
    unsigned ODCD2:1;
    unsigned ODCD3:1;
    unsigned ODCD4:1;
    unsigned ODCD5:1;
    unsigned :3;
    unsigned ODCD9:1;
    unsigned ODCD10:1;
    unsigned ODCD11:1;
    unsigned ODCD12:1;
    unsigned ODCD13:1;
    unsigned ODCD14:1;
    unsigned ODCD15:1;
  };
  struct {
    unsigned w:32;
  };
} __ODCDbits_t;
extern volatile __ODCDbits_t ODCDbits ;//__asm__ ("ODCD") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ODCDCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ODCDSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ODCDINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNPUD ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CNPUD0:1;
    unsigned CNPUD1:1;
    unsigned CNPUD2:1;
    unsigned CNPUD3:1;
    unsigned CNPUD4:1;
    unsigned CNPUD5:1;
    unsigned :3;
    unsigned CNPUD9:1;
    unsigned CNPUD10:1;
    unsigned CNPUD11:1;
    unsigned CNPUD12:1;
    unsigned CNPUD13:1;
    unsigned CNPUD14:1;
    unsigned CNPUD15:1;
  };
  struct {
    unsigned w:32;
  };
} __CNPUDbits_t;
extern volatile __CNPUDbits_t CNPUDbits ;//__asm__ ("CNPUD") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNPUDCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNPUDSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNPUDINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNPDD ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CNPDD0:1;
    unsigned CNPDD1:1;
    unsigned CNPDD2:1;
    unsigned CNPDD3:1;
    unsigned CNPDD4:1;
    unsigned CNPDD5:1;
    unsigned :3;
    unsigned CNPDD9:1;
    unsigned CNPDD10:1;
    unsigned CNPDD11:1;
    unsigned CNPDD12:1;
    unsigned CNPDD13:1;
    unsigned CNPDD14:1;
    unsigned CNPDD15:1;
  };
  struct {
    unsigned w:32;
  };
} __CNPDDbits_t;
extern volatile __CNPDDbits_t CNPDDbits ;//__asm__ ("CNPDD") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNPDDCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNPDDSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNPDDINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNCOND ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned :11;
    unsigned EDGEDETECT:1;
    unsigned :1;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned w:32;
  };
} __CNCONDbits_t;
extern volatile __CNCONDbits_t CNCONDbits ;//__asm__ ("CNCOND") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNCONDCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNCONDSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNCONDINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNEND ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CNIED0:1;
    unsigned CNIED1:1;
    unsigned CNIED2:1;
    unsigned CNIED3:1;
    unsigned CNIED4:1;
    unsigned CNIED5:1;
    unsigned :3;
    unsigned CNIED9:1;
    unsigned CNIED10:1;
    unsigned CNIED11:1;
    unsigned CNIED12:1;
    unsigned CNIED13:1;
    unsigned CNIED14:1;
    unsigned CNIED15:1;
  };
  struct {
    unsigned w:32;
  };
} __CNENDbits_t;
extern volatile __CNENDbits_t CNENDbits ;//__asm__ ("CNEND") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNENDCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNENDSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNENDINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNSTATD ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CNSTATD0:1;
    unsigned CNSTATD1:1;
    unsigned CNSTATD2:1;
    unsigned CNSTATD3:1;
    unsigned CNSTATD4:1;
    unsigned CNSTATD5:1;
    unsigned :3;
    unsigned CNSTATD9:1;
    unsigned CNSTATD10:1;
    unsigned CNSTATD11:1;
    unsigned CNSTATD12:1;
    unsigned CNSTATD13:1;
    unsigned CNSTATD14:1;
    unsigned CNSTATD15:1;
  };
  struct {
    unsigned w:32;
  };
} __CNSTATDbits_t;
extern volatile __CNSTATDbits_t CNSTATDbits ;//__asm__ ("CNSTATD") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNSTATDCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNSTATDSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNSTATDINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNNED ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CNNED0:1;
  unsigned CNNED1:1;
  unsigned CNNED2:1;
  unsigned CNNED3:1;
  unsigned CNNED4:1;
  unsigned CNNED5:1;
  unsigned :3;
  unsigned CNNED9:1;
  unsigned CNNED10:1;
  unsigned CNNED11:1;
  unsigned CNNED12:1;
  unsigned CNNED13:1;
  unsigned CNNED14:1;
  unsigned CNNED15:1;
} __CNNEDbits_t;
extern volatile __CNNEDbits_t CNNEDbits ;//__asm__ ("CNNED") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNFD ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CNFD0:1;
  unsigned CNFD1:1;
  unsigned CNFD2:1;
  unsigned CNFD3:1;
  unsigned CNFD4:1;
  unsigned CNFD5:1;
  unsigned :3;
  unsigned CNFD9:1;
  unsigned CNFD10:1;
  unsigned CNFD11:1;
  unsigned CNFD12:1;
  unsigned CNFD13:1;
  unsigned CNFD14:1;
  unsigned CNFD15:1;
} __CNFDbits_t;
extern volatile __CNFDbits_t CNFDbits ;//__asm__ ("CNFD") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ANSELE ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned :4;
    unsigned ANSE4:1;
    unsigned ANSE5:1;
    unsigned ANSE6:1;
    unsigned ANSE7:1;
    unsigned ANSE8:1;
    unsigned ANSE9:1;
  };
  struct {
    unsigned w:32;
  };
} __ANSELEbits_t;
extern volatile __ANSELEbits_t ANSELEbits ;//__asm__ ("ANSELE") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ANSELECLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ANSELESET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ANSELEINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        TRISE ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned TRISE0:1;
    unsigned TRISE1:1;
    unsigned TRISE2:1;
    unsigned TRISE3:1;
    unsigned TRISE4:1;
    unsigned TRISE5:1;
    unsigned TRISE6:1;
    unsigned TRISE7:1;
    unsigned TRISE8:1;
    unsigned TRISE9:1;
  };
  struct {
    unsigned w:32;
  };
} __TRISEbits_t;
extern volatile __TRISEbits_t TRISEbits ;//__asm__ ("TRISE") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        TRISECLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        TRISESET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        TRISEINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PORTE ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned RE0:1;
    unsigned RE1:1;
    unsigned RE2:1;
    unsigned RE3:1;
    unsigned RE4:1;
    unsigned RE5:1;
    unsigned RE6:1;
    unsigned RE7:1;
    unsigned RE8:1;
    unsigned RE9:1;
  };
  struct {
    unsigned w:32;
  };
} __PORTEbits_t;
extern volatile __PORTEbits_t PORTEbits ;//__asm__ ("PORTE") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PORTECLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PORTESET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PORTEINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        LATE ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned LATE0:1;
    unsigned LATE1:1;
    unsigned LATE2:1;
    unsigned LATE3:1;
    unsigned LATE4:1;
    unsigned LATE5:1;
    unsigned LATE6:1;
    unsigned LATE7:1;
    unsigned LATE8:1;
    unsigned LATE9:1;
  };
  struct {
    unsigned w:32;
  };
} __LATEbits_t;
extern volatile __LATEbits_t LATEbits ;//__asm__ ("LATE") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        LATECLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        LATESET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        LATEINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ODCE ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned ODCE0:1;
    unsigned ODCE1:1;
    unsigned ODCE2:1;
    unsigned ODCE3:1;
    unsigned ODCE4:1;
    unsigned ODCE5:1;
    unsigned ODCE6:1;
    unsigned ODCE7:1;
    unsigned ODCE8:1;
    unsigned ODCE9:1;
  };
  struct {
    unsigned w:32;
  };
} __ODCEbits_t;
extern volatile __ODCEbits_t ODCEbits ;//__asm__ ("ODCE") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ODCECLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ODCESET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ODCEINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNPUE ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CNPUE0:1;
    unsigned CNPUE1:1;
    unsigned CNPUE2:1;
    unsigned CNPUE3:1;
    unsigned CNPUE4:1;
    unsigned CNPUE5:1;
    unsigned CNPUE6:1;
    unsigned CNPUE7:1;
    unsigned CNPUE8:1;
    unsigned CNPUE9:1;
  };
  struct {
    unsigned w:32;
  };
} __CNPUEbits_t;
extern volatile __CNPUEbits_t CNPUEbits ;//__asm__ ("CNPUE") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNPUECLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNPUESET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNPUEINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNPDE ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CNPDE0:1;
    unsigned CNPDE1:1;
    unsigned CNPDE2:1;
    unsigned CNPDE3:1;
    unsigned CNPDE4:1;
    unsigned CNPDE5:1;
    unsigned CNPDE6:1;
    unsigned CNPDE7:1;
    unsigned CNPDE8:1;
    unsigned CNPDE9:1;
  };
  struct {
    unsigned w:32;
  };
} __CNPDEbits_t;
extern volatile __CNPDEbits_t CNPDEbits ;//__asm__ ("CNPDE") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNPDECLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNPDESET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNPDEINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNCONE ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned :11;
    unsigned EDGEDETECT:1;
    unsigned :1;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned w:32;
  };
} __CNCONEbits_t;
extern volatile __CNCONEbits_t CNCONEbits ;//__asm__ ("CNCONE") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNCONECLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNCONESET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNCONEINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNENE ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CNIEE0:1;
    unsigned CNIEE1:1;
    unsigned CNIEE2:1;
    unsigned CNIEE3:1;
    unsigned CNIEE4:1;
    unsigned CNIEE5:1;
    unsigned CNIEE6:1;
    unsigned CNIEE7:1;
    unsigned CNIEE8:1;
    unsigned CNIEE9:1;
  };
  struct {
    unsigned w:32;
  };
} __CNENEbits_t;
