HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.h
extern volatile __CNENEbits_t CNENEbits ;//__asm__ ("CNENE") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNENECLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNENESET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNENEINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNSTATE ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CNSTATE0:1;
    unsigned CNSTATE1:1;
    unsigned CNSTATE2:1;
    unsigned CNSTATE3:1;
    unsigned CNSTATE4:1;
    unsigned CNSTATE5:1;
    unsigned CNSTATE6:1;
    unsigned CNSTATE7:1;
    unsigned CNSTATE8:1;
    unsigned CNSTATE9:1;
  };
  struct {
    unsigned w:32;
  };
} __CNSTATEbits_t;
extern volatile __CNSTATEbits_t CNSTATEbits ;//__asm__ ("CNSTATE") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNSTATECLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNSTATESET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNSTATEINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNNEE ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CNNEE0:1;
  unsigned CNNEE1:1;
  unsigned CNNEE2:1;
  unsigned CNNEE3:1;
  unsigned CNNEE4:1;
  unsigned CNNEE5:1;
  unsigned CNNEE6:1;
  unsigned CNNEE7:1;
  unsigned CNNEE8:1;
  unsigned CNNEE9:1;
} __CNNEEbits_t;
extern volatile __CNNEEbits_t CNNEEbits ;//__asm__ ("CNNEE") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNFE ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CNFE0:1;
  unsigned CNFE1:1;
  unsigned CNFE2:1;
  unsigned CNFE3:1;
  unsigned CNFE4:1;
  unsigned CNFE5:1;
  unsigned CNFE6:1;
  unsigned CNFE7:1;
  unsigned CNFE8:1;
  unsigned CNFE9:1;
} __CNFEbits_t;
extern volatile __CNFEbits_t CNFEbits ;//__asm__ ("CNFE") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SRCON0E ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned SR0E0:1;
  unsigned SR0E1:1;
  unsigned SR0E2:1;
  unsigned SR0E3:1;
} __SRCON0Ebits_t;
extern volatile __SRCON0Ebits_t SRCON0Ebits ;//__asm__ ("SRCON0E") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SRCON1E ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned SR1E0:1;
  unsigned SR1E1:1;
  unsigned SR1E2:1;
  unsigned SR1E3:1;
} __SRCON1Ebits_t;
extern volatile __SRCON1Ebits_t SRCON1Ebits ;//__asm__ ("SRCON1E") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ANSELF ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned :12;
    unsigned ANSF12:1;
    unsigned ANSF13:1;
  };
  struct {
    unsigned w:32;
  };
} __ANSELFbits_t;
extern volatile __ANSELFbits_t ANSELFbits ;//__asm__ ("ANSELF") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ANSELFCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ANSELFSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ANSELFINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        TRISF ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned TRISF0:1;
    unsigned TRISF1:1;
    unsigned TRISF2:1;
    unsigned TRISF3:1;
    unsigned TRISF4:1;
    unsigned TRISF5:1;
    unsigned :2;
    unsigned TRISF8:1;
    unsigned :3;
    unsigned TRISF12:1;
    unsigned TRISF13:1;
  };
  struct {
    unsigned w:32;
  };
} __TRISFbits_t;
extern volatile __TRISFbits_t TRISFbits ;//__asm__ ("TRISF") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        TRISFCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        TRISFSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        TRISFINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PORTF ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned RF0:1;
    unsigned RF1:1;
    unsigned RF2:1;
    unsigned RF3:1;
    unsigned RF4:1;
    unsigned RF5:1;
    unsigned :2;
    unsigned RF8:1;
    unsigned :3;
    unsigned RF12:1;
    unsigned RF13:1;
  };
  struct {
    unsigned w:32;
  };
} __PORTFbits_t;
extern volatile __PORTFbits_t PORTFbits ;//__asm__ ("PORTF") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PORTFCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PORTFSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PORTFINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        LATF ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned LATF0:1;
    unsigned LATF1:1;
    unsigned LATF2:1;
    unsigned LATF3:1;
    unsigned LATF4:1;
    unsigned LATF5:1;
    unsigned :2;
    unsigned LATF8:1;
    unsigned :3;
    unsigned LATF12:1;
    unsigned LATF13:1;
  };
  struct {
    unsigned w:32;
  };
} __LATFbits_t;
extern volatile __LATFbits_t LATFbits ;//__asm__ ("LATF") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        LATFCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        LATFSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        LATFINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ODCF ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned ODCF0:1;
    unsigned ODCF1:1;
    unsigned ODCF2:1;
    unsigned ODCF3:1;
    unsigned ODCF4:1;
    unsigned ODCF5:1;
    unsigned :2;
    unsigned ODCF8:1;
    unsigned :3;
    unsigned ODCF12:1;
    unsigned ODCF13:1;
  };
  struct {
    unsigned w:32;
  };
} __ODCFbits_t;
extern volatile __ODCFbits_t ODCFbits ;//__asm__ ("ODCF") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ODCFCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ODCFSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ODCFINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNPUF ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CNPUF0:1;
    unsigned CNPUF1:1;
    unsigned CNPUF2:1;
    unsigned CNPUF3:1;
    unsigned CNPUF4:1;
    unsigned CNPUF5:1;
    unsigned :2;
    unsigned CNPUF8:1;
    unsigned :3;
    unsigned CNPUF12:1;
    unsigned CNPUF13:1;
  };
  struct {
    unsigned w:32;
  };
} __CNPUFbits_t;
extern volatile __CNPUFbits_t CNPUFbits ;//__asm__ ("CNPUF") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNPUFCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNPUFSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNPUFINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNPDF ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CNPDF0:1;
    unsigned CNPDF1:1;
    unsigned CNPDF2:1;
    unsigned CNPDF3:1;
    unsigned CNPDF4:1;
    unsigned CNPDF5:1;
    unsigned :2;
    unsigned CNPDF8:1;
    unsigned :3;
    unsigned CNPDF12:1;
    unsigned CNPDF13:1;
  };
  struct {
    unsigned w:32;
  };
} __CNPDFbits_t;
extern volatile __CNPDFbits_t CNPDFbits ;//__asm__ ("CNPDF") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNPDFCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNPDFSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNPDFINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNCONF ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned :11;
    unsigned EDGEDETECT:1;
    unsigned :1;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned w:32;
  };
} __CNCONFbits_t;
