HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.h
extern volatile __CNCONFbits_t CNCONFbits ;//__asm__ ("CNCONF") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNCONFCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNCONFSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNCONFINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNENF ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CNIEF0:1;
    unsigned CNIEF1:1;
    unsigned CNIEF2:1;
    unsigned CNIEF3:1;
    unsigned CNIEF4:1;
    unsigned CNIEF5:1;
    unsigned :2;
    unsigned CNIEF8:1;
    unsigned :3;
    unsigned CNIEF12:1;
    unsigned CNIEF13:1;
  };
  struct {
    unsigned w:32;
  };
} __CNENFbits_t;
extern volatile __CNENFbits_t CNENFbits ;//__asm__ ("CNENF") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNENFCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNENFSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNENFINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNSTATF ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CNSTATF0:1;
    unsigned CNSTATF1:1;
    unsigned CNSTATF2:1;
    unsigned CNSTATF3:1;
    unsigned CNSTATF4:1;
    unsigned CNSTATF5:1;
    unsigned :2;
    unsigned CNSTATF8:1;
    unsigned :3;
    unsigned CNSTATF12:1;
    unsigned CNSTATF13:1;
  };
  struct {
    unsigned w:32;
  };
} __CNSTATFbits_t;
extern volatile __CNSTATFbits_t CNSTATFbits ;//__asm__ ("CNSTATF") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNSTATFCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNSTATFSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNSTATFINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNNEF ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CNNEF0:1;
  unsigned CNNEF1:1;
  unsigned CNNEF2:1;
  unsigned CNNEF3:1;
  unsigned CNNEF4:1;
  unsigned CNNEF5:1;
  unsigned :2;
  unsigned CNNEF8:1;
  unsigned :3;
  unsigned CNNEF12:1;
  unsigned CNNEF13:1;
} __CNNEFbits_t;
extern volatile __CNNEFbits_t CNNEFbits ;//__asm__ ("CNNEF") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNFF ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CNFF0:1;
  unsigned CNFF1:1;
  unsigned CNFF2:1;
  unsigned CNFF3:1;
  unsigned CNFF4:1;
  unsigned CNFF5:1;
  unsigned :2;
  unsigned CNFF8:1;
  unsigned :3;
  unsigned CNFF12:1;
  unsigned CNFF13:1;
} __CNFFbits_t;
extern volatile __CNFFbits_t CNFFbits ;//__asm__ ("CNFF") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SRCON0F ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned SR0F0:1;
  unsigned SR0F1:1;
} __SRCON0Fbits_t;
extern volatile __SRCON0Fbits_t SRCON0Fbits ;//__asm__ ("SRCON0F") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SRCON1F ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned SR1F0:1;
  unsigned SR1F1:1;
} __SRCON1Fbits_t;
extern volatile __SRCON1Fbits_t SRCON1Fbits ;//__asm__ ("SRCON1F") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ANSELG ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned :6;
    unsigned ANSG6:1;
    unsigned ANSG7:1;
    unsigned ANSG8:1;
    unsigned ANSG9:1;
    unsigned :5;
    unsigned ANSG15:1;
  };
  struct {
    unsigned w:32;
  };
} __ANSELGbits_t;
extern volatile __ANSELGbits_t ANSELGbits ;//__asm__ ("ANSELG") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ANSELGCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ANSELGSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ANSELGINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        TRISG ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned TRISG0:1;
    unsigned TRISG1:1;
    unsigned :4;
    unsigned TRISG6:1;
    unsigned TRISG7:1;
    unsigned TRISG8:1;
    unsigned TRISG9:1;
    unsigned :2;
    unsigned TRISG12:1;
    unsigned TRISG13:1;
    unsigned TRISG14:1;
    unsigned TRISG15:1;
  };
  struct {
    unsigned w:32;
  };
} __TRISGbits_t;
extern volatile __TRISGbits_t TRISGbits ;//__asm__ ("TRISG") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        TRISGCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        TRISGSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        TRISGINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PORTG ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned RG0:1;
    unsigned RG1:1;
    unsigned :4;
    unsigned RG6:1;
    unsigned RG7:1;
    unsigned RG8:1;
    unsigned RG9:1;
    unsigned :2;
    unsigned RG12:1;
    unsigned RG13:1;
    unsigned RG14:1;
    unsigned RG15:1;
  };
  struct {
    unsigned w:32;
  };
} __PORTGbits_t;
extern volatile __PORTGbits_t PORTGbits ;//__asm__ ("PORTG") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PORTGCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PORTGSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PORTGINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        LATG ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned LATG0:1;
    unsigned LATG1:1;
    unsigned :4;
    unsigned LATG6:1;
    unsigned LATG7:1;
    unsigned LATG8:1;
    unsigned LATG9:1;
    unsigned :2;
    unsigned LATG12:1;
    unsigned LATG13:1;
    unsigned LATG14:1;
    unsigned LATG15:1;
  };
  struct {
    unsigned w:32;
  };
} __LATGbits_t;
extern volatile __LATGbits_t LATGbits ;//__asm__ ("LATG") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        LATGCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        LATGSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        LATGINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ODCG ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned ODCG0:1;
    unsigned ODCG1:1;
    unsigned :4;
    unsigned ODCG6:1;
    unsigned ODCG7:1;
    unsigned ODCG8:1;
    unsigned ODCG9:1;
    unsigned :2;
    unsigned ODCG12:1;
    unsigned ODCG13:1;
    unsigned ODCG14:1;
    unsigned ODCG15:1;
  };
  struct {
    unsigned w:32;
  };
} __ODCGbits_t;
