HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.h
extern volatile __ODCGbits_t ODCGbits ;//__asm__ ("ODCG") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ODCGCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ODCGSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ODCGINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNPUG ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CNPUG0:1;
    unsigned CNPUG1:1;
    unsigned :4;
    unsigned CNPUG6:1;
    unsigned CNPUG7:1;
    unsigned CNPUG8:1;
    unsigned CNPUG9:1;
    unsigned :2;
    unsigned CNPUG12:1;
    unsigned CNPUG13:1;
    unsigned CNPUG14:1;
    unsigned CNPUG15:1;
  };
  struct {
    unsigned w:32;
  };
} __CNPUGbits_t;
extern volatile __CNPUGbits_t CNPUGbits ;//__asm__ ("CNPUG") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNPUGCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNPUGSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNPUGINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNPDG ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CNPDG0:1;
    unsigned CNPDG1:1;
    unsigned :4;
    unsigned CNPDG6:1;
    unsigned CNPDG7:1;
    unsigned CNPDG8:1;
    unsigned CNPDG9:1;
    unsigned :2;
    unsigned CNPDG12:1;
    unsigned CNPDG13:1;
    unsigned CNPDG14:1;
    unsigned CNPDG15:1;
  };
  struct {
    unsigned w:32;
  };
} __CNPDGbits_t;
extern volatile __CNPDGbits_t CNPDGbits ;//__asm__ ("CNPDG") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNPDGCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNPDGSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNPDGINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNCONG ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned :11;
    unsigned EDGEDETECT:1;
    unsigned :1;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned w:32;
  };
} __CNCONGbits_t;
extern volatile __CNCONGbits_t CNCONGbits ;//__asm__ ("CNCONG") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNCONGCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNCONGSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNCONGINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNENG ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CNIEG0:1;
    unsigned CNIEG1:1;
    unsigned :4;
    unsigned CNIEG6:1;
    unsigned CNIEG7:1;
    unsigned CNIEG8:1;
    unsigned CNIEG9:1;
    unsigned :2;
    unsigned CNIEG12:1;
    unsigned CNIEG13:1;
    unsigned CNIEG14:1;
    unsigned CNIEG15:1;
  };
  struct {
    unsigned w:32;
  };
} __CNENGbits_t;
extern volatile __CNENGbits_t CNENGbits ;//__asm__ ("CNENG") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNENGCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNENGSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNENGINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNSTATG ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CNSTATG0:1;
    unsigned CNSTATG1:1;
    unsigned :4;
    unsigned CNSTATG6:1;
    unsigned CNSTATG7:1;
    unsigned CNSTATG8:1;
    unsigned CNSTATG9:1;
    unsigned :2;
    unsigned CNSTATG12:1;
    unsigned CNSTATG13:1;
    unsigned CNSTATG14:1;
    unsigned CNSTATG15:1;
  };
  struct {
    unsigned w:32;
  };
} __CNSTATGbits_t;
extern volatile __CNSTATGbits_t CNSTATGbits ;//__asm__ ("CNSTATG") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNSTATGCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNSTATGSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNSTATGINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNNEG ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CNNEG0:1;
  unsigned CNNEG1:1;
  unsigned :4;
  unsigned CNNEG6:1;
  unsigned CNNEG7:1;
  unsigned CNNEG8:1;
  unsigned CNNEG9:1;
  unsigned :2;
  unsigned CNNEG12:1;
  unsigned CNNEG13:1;
  unsigned CNNEG14:1;
  unsigned CNNEG15:1;
} __CNNEGbits_t;
extern volatile __CNNEGbits_t CNNEGbits ;//__asm__ ("CNNEG") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        CNFG ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CNFG0:1;
  unsigned CNFG1:1;
  unsigned :4;
  unsigned CNFG6:1;
  unsigned CNFG7:1;
  unsigned CNFG8:1;
  unsigned CNFG9:1;
  unsigned :2;
  unsigned CNFG12:1;
  unsigned CNFG13:1;
  unsigned CNFG14:1;
  unsigned CNFG15:1;
} __CNFGbits_t;
extern volatile __CNFGbits_t CNFGbits ;//__asm__ ("CNFG") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SRCON0G ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :6;
  unsigned SR0G6:1;
  unsigned :2;
  unsigned SR0G9:1;
  unsigned :2;
  unsigned SR0G12:1;
  unsigned SR0G13:1;
  unsigned SR0G14:1;
} __SRCON0Gbits_t;
extern volatile __SRCON0Gbits_t SRCON0Gbits ;//__asm__ ("SRCON0G") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SRCON1G ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :6;
  unsigned SR1G6:1;
  unsigned :2;
  unsigned SR1G9:1;
  unsigned :2;
  unsigned SR1G12:1;
  unsigned SR1G13:1;
  unsigned SR1G14:1;
} __SRCON1Gbits_t;
extern volatile __SRCON1Gbits_t SRCON1Gbits ;//__asm__ ("SRCON1G") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHCON1 ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned BUFCDEC:1;
    unsigned :3;
    unsigned MANFC:1;
    unsigned :2;
    unsigned AUTOFC:1;
    unsigned RXEN:1;
    unsigned TXRTS:1;
    unsigned :3;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
    unsigned PTV:16;
  };
  struct {
    unsigned w:32;
  };
} __ETHCON1bits_t;
extern volatile __ETHCON1bits_t ETHCON1bits ;//__asm__ ("ETHCON1") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHCON1CLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHCON1SET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHCON1INV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHCON2 ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned :4;
    unsigned RXBUF_SZ:7;
  };
  struct {
    unsigned w:32;
  };
} __ETHCON2bits_t;
extern volatile __ETHCON2bits_t ETHCON2bits ;//__asm__ ("ETHCON2") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHCON2CLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHCON2SET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHCON2INV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHTXST ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned :2;
    unsigned TXSTADDR:30;
  };
  struct {
    unsigned w:32;
  };
} __ETHTXSTbits_t;
extern volatile __ETHTXSTbits_t ETHTXSTbits ;//__asm__ ("ETHTXST") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHTXSTCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHTXSTSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHTXSTINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHRXST ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned :2;
    unsigned RXSTADDR:30;
  };
  struct {
    unsigned w:32;
  };
} __ETHRXSTbits_t;
extern volatile __ETHRXSTbits_t ETHRXSTbits ;//__asm__ ("ETHRXST") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHRXSTCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHRXSTSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHRXSTINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHHT0 ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned w:32;
  };
  struct {
    unsigned HTLOWER:32;
  };
} __ETHHT0bits_t;
extern volatile __ETHHT0bits_t ETHHT0bits ;//__asm__ ("ETHHT0") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHHT0CLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHHT0SET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHHT0INV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHHT1 ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned w:32;
  };
  struct {
    unsigned HTUPPER:32;
  };
} __ETHHT1bits_t;
extern volatile __ETHHT1bits_t ETHHT1bits ;//__asm__ ("ETHHT1") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHHT1CLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHHT1SET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHHT1INV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHPMM0 ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned w:32;
  };
  struct {
    unsigned PMMLOWER:32;
  };
} __ETHPMM0bits_t;
extern volatile __ETHPMM0bits_t ETHPMM0bits ;//__asm__ ("ETHPMM0") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHPMM0CLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHPMM0SET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHPMM0INV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHPMM1 ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned w:32;
  };
  struct {
    unsigned PMMUPPER:32;
  };
} __ETHPMM1bits_t;
extern volatile __ETHPMM1bits_t ETHPMM1bits ;//__asm__ ("ETHPMM1") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHPMM1CLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHPMM1SET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHPMM1INV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHPMCS ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned PMCS:16;
  };
  struct {
    unsigned w:32;
  };
} __ETHPMCSbits_t;
