HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.h
extern volatile __ETHPMCSbits_t ETHPMCSbits ;//__asm__ ("ETHPMCS") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHPMCSCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHPMCSSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHPMCSINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHPMO ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned PMO:16;
  };
  struct {
    unsigned w:32;
  };
} __ETHPMObits_t;
extern volatile __ETHPMObits_t ETHPMObits ;//__asm__ ("ETHPMO") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHPMOCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHPMOSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHPMOINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHRXFC ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned BCEN:1;
    unsigned MCEN:1;
    unsigned NOTMEEN:1;
    unsigned UCEN:1;
    unsigned RUNTEN:1;
    unsigned RUNTERREN:1;
    unsigned CRCOKEN:1;
    unsigned CRCERREN:1;
    unsigned PMMODE:4;
    unsigned NOTPM:1;
    unsigned :1;
    unsigned MPEN:1;
    unsigned HTEN:1;
  };
  struct {
    unsigned w:32;
  };
} __ETHRXFCbits_t;
extern volatile __ETHRXFCbits_t ETHRXFCbits ;//__asm__ ("ETHRXFC") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHRXFCCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHRXFCSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHRXFCINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHRXWM ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned RXEWM:8;
    unsigned :8;
    unsigned RXFWM:8;
  };
  struct {
    unsigned w:32;
  };
} __ETHRXWMbits_t;
extern volatile __ETHRXWMbits_t ETHRXWMbits ;//__asm__ ("ETHRXWM") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHRXWMCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHRXWMSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHRXWMINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHIEN ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned RXOVFLWIE:1;
    unsigned RXBUFNAIE:1;
    unsigned TXABORTIE:1;
    unsigned TXDONEIE:1;
    unsigned :1;
    unsigned RXACTIE:1;
    unsigned PKTPENDIE:1;
    unsigned RXDONEIE:1;
    unsigned FWMARKIE:1;
    unsigned EWMARKIE:1;
    unsigned :3;
    unsigned RXBUSEIE:1;
    unsigned TXBUSEIE:1;
  };
  struct {
    unsigned w:32;
  };
} __ETHIENbits_t;
extern volatile __ETHIENbits_t ETHIENbits ;//__asm__ ("ETHIEN") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHIENCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHIENSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHIENINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHIRQ ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned RXOVFLW:1;
    unsigned RXBUFNA:1;
    unsigned TXABORT:1;
    unsigned TXDONE:1;
    unsigned :1;
    unsigned RXACT:1;
    unsigned PKTPEND:1;
    unsigned RXDONE:1;
    unsigned FWMARK:1;
    unsigned EWMARK:1;
    unsigned :3;
    unsigned RXBUSE:1;
    unsigned TXBUSE:1;
  };
  struct {
    unsigned w:32;
  };
} __ETHIRQbits_t;
extern volatile __ETHIRQbits_t ETHIRQbits ;//__asm__ ("ETHIRQ") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHIRQCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHIRQSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHIRQINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHSTAT ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned :5;
    unsigned RXBUSY:1;
    unsigned TXBUSY:1;
    unsigned BUSY:1;
    unsigned :8;
    unsigned BUFCNT:8;
  };
  struct {
    unsigned :7;
    unsigned ETHBUSY:1;
  };
  struct {
    unsigned w:32;
  };
} __ETHSTATbits_t;
extern volatile __ETHSTATbits_t ETHSTATbits ;//__asm__ ("ETHSTAT") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHSTATCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHSTATSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHSTATINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHRXOVFLOW ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned RXOVFLWCNT:16;
  };
  struct {
    unsigned w:32;
  };
} __ETHRXOVFLOWbits_t;
extern volatile __ETHRXOVFLOWbits_t ETHRXOVFLOWbits ;//__asm__ ("ETHRXOVFLOW") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHRXOVFLOWCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHRXOVFLOWSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHRXOVFLOWINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHFRMTXOK ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned FRMTXOKCNT:16;
  };
  struct {
    unsigned w:32;
  };
} __ETHFRMTXOKbits_t;
extern volatile __ETHFRMTXOKbits_t ETHFRMTXOKbits ;//__asm__ ("ETHFRMTXOK") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHFRMTXOKCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHFRMTXOKSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHFRMTXOKINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHSCOLFRM ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned SCOLFRMCNT:16;
  };
  struct {
    unsigned w:32;
  };
} __ETHSCOLFRMbits_t;
extern volatile __ETHSCOLFRMbits_t ETHSCOLFRMbits ;//__asm__ ("ETHSCOLFRM") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHSCOLFRMCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHSCOLFRMSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHSCOLFRMINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHMCOLFRM ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned MCOLFRMCNT:16;
  };
  struct {
    unsigned MCOLFRM_CNT:16;
  };
  struct {
    unsigned w:32;
  };
} __ETHMCOLFRMbits_t;
extern volatile __ETHMCOLFRMbits_t ETHMCOLFRMbits ;//__asm__ ("ETHMCOLFRM") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHMCOLFRMCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHMCOLFRMSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHMCOLFRMINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        ETHFRMRXOK ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned FRMRXOKCNT:16;
  };
  struct {
    unsigned w:32;
  };
} __ETHFRMRXOKbits_t;
