HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.h
extern volatile __EMAC1MADRbits_t EMAC1MADRbits ;//__asm__ ("EMAC1MADR") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        EMACxMADR ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned REGADDR:5;
    unsigned :3;
    unsigned PHYADDR:5;
  };
  struct {
    unsigned w:32;
  };
} __EMACxMADRbits_t;
extern volatile __EMACxMADRbits_t EMACxMADRbits ;//__asm__ ("EMACxMADR") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        EMAC1MADRCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        EMACxMADRCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        EMAC1MADRSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        EMACxMADRSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        EMAC1MADRINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        EMACxMADRINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        EMAC1MWTD ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned MWTD:16;
  };
  struct {
    unsigned w:32;
  };
} __EMAC1MWTDbits_t;
extern volatile __EMAC1MWTDbits_t EMAC1MWTDbits ;//__asm__ ("EMAC1MWTD") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        EMACxMWTD ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned MWTD:16;
  };
  struct {
    unsigned w:32;
  };
} __EMACxMWTDbits_t;
extern volatile __EMACxMWTDbits_t EMACxMWTDbits ;//__asm__ ("EMACxMWTD") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        EMAC1MWTDCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        EMACxMWTDCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        EMAC1MWTDSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        EMACxMWTDSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        EMAC1MWTDINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        EMACxMWTDINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        EMAC1MRDD ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned MRDD:16;
  };
  struct {
    unsigned w:32;
  };
} __EMAC1MRDDbits_t;
extern volatile __EMAC1MRDDbits_t EMAC1MRDDbits ;//__asm__ ("EMAC1MRDD") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        EMACxMRDD ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned MRDD:16;
  };
  struct {
    unsigned w:32;
  };
} __EMACxMRDDbits_t;
extern volatile __EMACxMRDDbits_t EMACxMRDDbits ;//__asm__ ("EMACxMRDD") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        EMAC1MRDDCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        EMACxMRDDCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        EMAC1MRDDSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        EMACxMRDDSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        EMAC1MRDDINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        EMACxMRDDINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        EMAC1MIND ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned MIIMBUSY:1;
    unsigned SCAN:1;
    unsigned NOTVALID:1;
    unsigned LINKFAIL:1;
  };
  struct {
    unsigned w:32;
  };
} __EMAC1MINDbits_t;
extern volatile __EMAC1MINDbits_t EMAC1MINDbits ;//__asm__ ("EMAC1MIND") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        EMACxMIND ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned MIIMBUSY:1;
    unsigned SCAN:1;
    unsigned NOTVALID:1;
    unsigned LINKFAIL:1;
  };
  struct {
    unsigned w:32;
  };
} __EMACxMINDbits_t;
extern volatile __EMACxMINDbits_t EMACxMINDbits ;//__asm__ ("EMACxMIND") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        EMAC1MINDCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        EMACxMINDCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        EMAC1MINDSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        EMACxMINDSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        EMAC1MINDINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        EMACxMINDINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        EMAC1SA0 ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned STNADDR5:8;
    unsigned STNADDR6:8;
  };
  struct {
    unsigned w:32;
  };
} __EMAC1SA0bits_t;
extern volatile __EMAC1SA0bits_t EMAC1SA0bits ;//__asm__ ("EMAC1SA0") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        EMACxSA0 ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned STNADDR5:8;
    unsigned STNADDR6:8;
  };
  struct {
    unsigned w:32;
  };
} __EMACxSA0bits_t;
extern volatile __EMACxSA0bits_t EMACxSA0bits ;//__asm__ ("EMACxSA0") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        EMAC1SA0CLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        EMACxSA0CLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        EMAC1SA0SET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        EMACxSA0SET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        EMAC1SA0INV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        EMACxSA0INV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        EMAC1SA1 ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned STNADDR3:8;
    unsigned STNADDR4:8;
  };
  struct {
    unsigned w:32;
  };
} __EMAC1SA1bits_t;
extern volatile __EMAC1SA1bits_t EMAC1SA1bits ;//__asm__ ("EMAC1SA1") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        EMACxSA1 ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned STNADDR3:8;
    unsigned STNADDR4:8;
  };
  struct {
    unsigned w:32;
  };
} __EMACxSA1bits_t;
extern volatile __EMACxSA1bits_t EMACxSA1bits ;//__asm__ ("EMACxSA1") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        EMAC1SA1CLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        EMACxSA1CLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        EMAC1SA1SET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        EMACxSA1SET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        EMAC1SA1INV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        EMACxSA1INV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        EMAC1SA2 ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned STNADDR1:8;
    unsigned STNADDR2:8;
  };
  struct {
    unsigned w:32;
  };
} __EMAC1SA2bits_t;
