HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.h
extern volatile __EMAC1SA2bits_t EMAC1SA2bits ;//__asm__ ("EMAC1SA2") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        EMACxSA2 ;//__attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned STNADDR1:8;
    unsigned STNADDR2:8;
  };
  struct {
    unsigned w:32;
  };
} __EMACxSA2bits_t;
extern volatile __EMACxSA2bits_t EMACxSA2bits ;//__asm__ ("EMACxSA2") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        EMAC1SA2CLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        EMACxSA2CLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        EMAC1SA2SET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        EMACxSA2SET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        EMAC1SA2INV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        EMACxSA2INV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        USBCRCON ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned USBWKUPEN:1;
  unsigned USBRIE:1;
  unsigned USBIE:1;
  unsigned SENDMONEN:1;
  unsigned BSVALMONEN:1;
  unsigned ASVALMONEN:1;
  unsigned VBUSMONEN:1;
  unsigned PHYIDEN:1;
  unsigned USBIDVAL:1;
  unsigned USBIDOVEN:1;
  unsigned :14;
  unsigned USBWKUP:1;
  unsigned USBRF:1;
  unsigned USBIF:1;
} __USBCRCONbits_t;
extern volatile __USBCRCONbits_t USBCRCONbits ;//__asm__ ("USBCRCON") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PRECON ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned PFMWS:3;
  unsigned :1;
  unsigned PREFEN:2;
  unsigned :20;
  unsigned PFMSECEN:1;
} __PRECONbits_t;
extern volatile __PRECONbits_t PRECONbits ;//__asm__ ("PRECON") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PRECONCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PRECONSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PRECONINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PRESTAT ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned PFMSECCNT:8;
  unsigned :18;
  unsigned PFMSEC:1;
  unsigned PFMDED:1;
} __PRESTATbits_t;
extern volatile __PRESTATbits_t PRESTATbits ;//__asm__ ("PRESTAT") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PRESTATCLR ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PRESTATSET ;//__attribute__((section("sfrs")));
extern volatile unsigned int        PRESTATINV ;//__attribute__((section("sfrs")));
extern volatile unsigned int        EBICS0 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :16;
  unsigned CSADDR:16;
} __EBICS0bits_t;
extern volatile __EBICS0bits_t EBICS0bits ;//__asm__ ("EBICS0") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        EBICS1 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :16;
  unsigned CSADDR:16;
} __EBICS1bits_t;
extern volatile __EBICS1bits_t EBICS1bits ;//__asm__ ("EBICS1") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        EBICS2 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :16;
  unsigned CSADDR:16;
} __EBICS2bits_t;
extern volatile __EBICS2bits_t EBICS2bits ;//__asm__ ("EBICS2") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        EBICS3 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :16;
  unsigned CSADDR:16;
} __EBICS3bits_t;
extern volatile __EBICS3bits_t EBICS3bits ;//__asm__ ("EBICS3") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        EBIMSK0 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned MEMSIZE:5;
  unsigned MEMTYPE:3;
  unsigned REGSEL:3;
} __EBIMSK0bits_t;
extern volatile __EBIMSK0bits_t EBIMSK0bits ;//__asm__ ("EBIMSK0") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        EBIMSK1 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned MEMSIZE:5;
  unsigned MEMTYPE:3;
  unsigned REGSEL:3;
} __EBIMSK1bits_t;
extern volatile __EBIMSK1bits_t EBIMSK1bits ;//__asm__ ("EBIMSK1") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        EBIMSK2 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned MEMSIZE:5;
  unsigned MEMTYPE:3;
  unsigned REGSEL:3;
} __EBIMSK2bits_t;
extern volatile __EBIMSK2bits_t EBIMSK2bits ;//__asm__ ("EBIMSK2") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        EBIMSK3 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned MEMSIZE:5;
  unsigned MEMTYPE:3;
  unsigned REGSEL:3;
} __EBIMSK3bits_t;
extern volatile __EBIMSK3bits_t EBIMSK3bits ;//__asm__ ("EBIMSK3") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        EBISMT0 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned TRC:6;
  unsigned TAS:2;
  unsigned TWR:2;
  unsigned TWP:6;
  unsigned TBTA:3;
  unsigned TPRC:4;
  unsigned PAGEMODE:1;
  unsigned PAGESIZE:2;
  unsigned RDYMODE:1;
} __EBISMT0bits_t;
extern volatile __EBISMT0bits_t EBISMT0bits ;//__asm__ ("EBISMT0") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        EBISMT1 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned TRC:6;
  unsigned TAS:2;
  unsigned TWR:2;
  unsigned TWP:6;
  unsigned TBTA:3;
  unsigned TPRC:4;
  unsigned PAGEMODE:1;
  unsigned PAGESIZE:2;
  unsigned RDYMODE:1;
} __EBISMT1bits_t;
extern volatile __EBISMT1bits_t EBISMT1bits ;//__asm__ ("EBISMT1") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        EBISMT2 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned TRC:6;
  unsigned TAS:2;
  unsigned TWR:2;
  unsigned TWP:6;
  unsigned TBTA:3;
  unsigned TPRC:4;
  unsigned PAGEMODE:1;
  unsigned PAGESIZE:2;
  unsigned RDYMODE:1;
} __EBISMT2bits_t;
extern volatile __EBISMT2bits_t EBISMT2bits ;//__asm__ ("EBISMT2") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        EBIFTRPD ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned TRPD:31;
} __EBIFTRPDbits_t;
extern volatile __EBIFTRPDbits_t EBIFTRPDbits ;//__asm__ ("EBIFTRPD") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        EBISMCON ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned SMRP:1;
  unsigned :6;
  unsigned SMDWIDTH0:3;
  unsigned SMDWIDTH1:3;
  unsigned SMDWIDTH2:3;
} __EBISMCONbits_t;
extern volatile __EBISMCONbits_t EBISMCONbits ;//__asm__ ("EBISMCON") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SQI1XCON1 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned TYPECMD:2;
  unsigned TYPEADDR:2;
  unsigned TYPEMODE:2;
  unsigned TYPEDUMMY:2;
  unsigned TYPEDATA:2;
  unsigned READOPCODE:8;
  unsigned ADDRBYTES:3;
  unsigned DUMMYBYTES:3;
  unsigned DDRCMD:1;
  unsigned DDRADDR:1;
  unsigned DDRMODE:1;
  unsigned DDRDUMMY:1;
  unsigned DDRDATA:1;
  unsigned SDRCMD:1;
} __SQI1XCON1bits_t;
extern volatile __SQI1XCON1bits_t SQI1XCON1bits ;//__asm__ ("SQI1XCON1") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SQI1XCON2 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned MODECODE:8;
  unsigned MODEBYTES:2;
  unsigned DEVSEL:2;
} __SQI1XCON2bits_t;
extern volatile __SQI1XCON2bits_t SQI1XCON2bits ;//__asm__ ("SQI1XCON2") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SQI1CFG ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned MODE:3;
  unsigned CPHA:1;
  unsigned CPOL:1;
  unsigned LSBF:1;
  unsigned :3;
  unsigned WP:1;
  unsigned HOLD:1;
  unsigned :1;
  unsigned BURSTEN:1;
  unsigned :3;
  unsigned RESET:1;
  unsigned TXBUFRST:1;
  unsigned RXBUFRST:1;
  unsigned CONBUFRST:1;
  unsigned DATAEN:2;
  unsigned :1;
  unsigned SQIEN:1;
  unsigned CSEN:2;
} __SQI1CFGbits_t;
extern volatile __SQI1CFGbits_t SQI1CFGbits ;//__asm__ ("SQI1CFG") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SQI1CON ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned TXRXCOUNT:16;
  unsigned CMDINIT:2;
  unsigned LANEMODE:2;
  unsigned DEVSEL:2;
  unsigned DASSERT:1;
  unsigned DDRMODE:1;
  unsigned SCHECK:1;
} __SQI1CONbits_t;
