HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.h
extern volatile __SQI1CONbits_t SQI1CONbits ;//__asm__ ("SQI1CON") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SQI1CLKCON ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned EN:1;
  unsigned STABLE:1;
  unsigned :6;
  unsigned CLKDIV:11;
} __SQI1CLKCONbits_t;
extern volatile __SQI1CLKCONbits_t SQI1CLKCONbits ;//__asm__ ("SQI1CLKCON") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SQI1CMDTHR ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned RXCMDTHR:6;
  unsigned :2;
  unsigned TXCMDTHR:6;
} __SQI1CMDTHRbits_t;
extern volatile __SQI1CMDTHRbits_t SQI1CMDTHRbits ;//__asm__ ("SQI1CMDTHR") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SQI1INTTHR ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned RXINTTHR:6;
  unsigned :2;
  unsigned TXINTTHR:6;
} __SQI1INTTHRbits_t;
extern volatile __SQI1INTTHRbits_t SQI1INTTHRbits ;//__asm__ ("SQI1INTTHR") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SQI1INTEN ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned TXEMPTYIE:1;
  unsigned TXFULLIE:1;
  unsigned TXTHRIE:1;
  unsigned RXEMPTYIE:1;
  unsigned RXFULLIE:1;
  unsigned RXTHRIE:1;
  unsigned CONFULLIE:1;
  unsigned CONEMPTYIE:1;
  unsigned CONTHRIE:1;
  unsigned BDDONEIE:1;
  unsigned PKTCOMPIE:1;
  unsigned DMAEIE:1;
} __SQI1INTENbits_t;
extern volatile __SQI1INTENbits_t SQI1INTENbits ;//__asm__ ("SQI1INTEN") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SQI1INTSTAT ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned TXEMPTYIF:1;
  unsigned TXFULLIF:1;
  unsigned TXTHRIF:1;
  unsigned RXEMPTYIF:1;
  unsigned RXFULLIF:1;
  unsigned RXTHRIF:1;
  unsigned CONFULLIF:1;
  unsigned CONEMPTYIF:1;
  unsigned CONTHRIF:1;
  unsigned BDDONEIF:1;
  unsigned PKTCOMPIF:1;
  unsigned DMAEIF:1;
} __SQI1INTSTATbits_t;
extern volatile __SQI1INTSTATbits_t SQI1INTSTATbits ;//__asm__ ("SQI1INTSTAT") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SQI1TXDATA ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned TXDATA:32;
} __SQI1TXDATAbits_t;
extern volatile __SQI1TXDATAbits_t SQI1TXDATAbits ;//__asm__ ("SQI1TXDATA") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SQI1RXDATA ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned RXDATA:32;
} __SQI1RXDATAbits_t;
extern volatile __SQI1RXDATAbits_t SQI1RXDATAbits ;//__asm__ ("SQI1RXDATA") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SQI1STAT1 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned RXBUFCNT:6;
  unsigned :10;
  unsigned TXBUFFREE:6;
} __SQI1STAT1bits_t;
extern volatile __SQI1STAT1bits_t SQI1STAT1bits ;//__asm__ ("SQI1STAT1") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SQI1STAT2 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned TXOV:1;
  unsigned RXUN:1;
  unsigned :1;
  unsigned SQID0:1;
  unsigned SQID1:1;
  unsigned SQID2:1;
  unsigned SQID3:1;
  unsigned CONAVAIL:4;
  unsigned :5;
  unsigned CMDSTAT:2;
} __SQI1STAT2bits_t;
extern volatile __SQI1STAT2bits_t SQI1STAT2bits ;//__asm__ ("SQI1STAT2") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SQI1BDCON ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned DMAEN:1;
  unsigned POLLEN:1;
  unsigned START:1;
} __SQI1BDCONbits_t;
extern volatile __SQI1BDCONbits_t SQI1BDCONbits ;//__asm__ ("SQI1BDCON") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SQI1BDCURADD ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned BDCURRADDR:32;
} __SQI1BDCURADDbits_t;
extern volatile __SQI1BDCURADDbits_t SQI1BDCURADDbits ;//__asm__ ("SQI1BDCURADD") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SQI1BDBASEADD ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned BDADDR:32;
} __SQI1BDBASEADDbits_t;
extern volatile __SQI1BDBASEADDbits_t SQI1BDBASEADDbits ;//__asm__ ("SQI1BDBASEADD") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SQI1BDSTAT ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned BDCON:16;
  unsigned DMAACTV:1;
  unsigned DMASTART:1;
  unsigned BDSTATE:4;
} __SQI1BDSTATbits_t;
extern volatile __SQI1BDSTATbits_t SQI1BDSTATbits ;//__asm__ ("SQI1BDSTAT") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SQI1BDPOLLCON ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned POLLCON:16;
} __SQI1BDPOLLCONbits_t;
extern volatile __SQI1BDPOLLCONbits_t SQI1BDPOLLCONbits ;//__asm__ ("SQI1BDPOLLCON") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SQI1BDTXDSTAT ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned TXCURBUFLEN:9;
  unsigned :7;
  unsigned TXBUFCNT:5;
  unsigned :4;
  unsigned TXSTATE:4;
} __SQI1BDTXDSTATbits_t;
extern volatile __SQI1BDTXDSTATbits_t SQI1BDTXDSTATbits ;//__asm__ ("SQI1BDTXDSTAT") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SQI1BDRXDSTAT ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned RXCURBUFLEN:9;
  unsigned :7;
  unsigned RXBUFCNT:5;
  unsigned :4;
  unsigned RXSTATE:4;
} __SQI1BDRXDSTATbits_t;
extern volatile __SQI1BDRXDSTATbits_t SQI1BDRXDSTATbits ;//__asm__ ("SQI1BDRXDSTAT") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SQI1THR ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned THRES:4;
} __SQI1THRbits_t;
extern volatile __SQI1THRbits_t SQI1THRbits ;//__asm__ ("SQI1THR") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SQI1INTSIGEN ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned TXEMPTYISE:1;
  unsigned TXFULLISE:1;
  unsigned TXTHRISE:1;
  unsigned RXEMPTYISE:1;
  unsigned RXFULLISE:1;
  unsigned RXTHRISE:1;
  unsigned CONFULLISE:1;
  unsigned CONEMPTYISE:1;
  unsigned CONTHRISE:1;
  unsigned BDDONEISE:1;
  unsigned PKTCOMPISE:1;
  unsigned DMAEISE:1;
} __SQI1INTSIGENbits_t;
extern volatile __SQI1INTSIGENbits_t SQI1INTSIGENbits ;//__asm__ ("SQI1INTSIGEN") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SQI1TAPCON ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CLKOUTDLY:4;
  unsigned DATAOUTDLY:4;
  unsigned SDRCLKINDLY:6;
} __SQI1TAPCONbits_t;
extern volatile __SQI1TAPCONbits_t SQI1TAPCONbits ;//__asm__ ("SQI1TAPCON") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SQI1MEMSTAT ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned STATCMD:16;
  unsigned STATBYTES:2;
  unsigned STATTYPE:2;
  unsigned STATPOS:1;
} __SQI1MEMSTATbits_t;
extern volatile __SQI1MEMSTATbits_t SQI1MEMSTATbits ;//__asm__ ("SQI1MEMSTAT") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SQI1XCON3 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned INIT1CMD1:8;
  unsigned INIT1CMD2:8;
  unsigned INIT1CMD3:8;
  unsigned INIT1TYPE:2;
  unsigned INIT1COUNT:2;
  unsigned INIT1SCHECK:1;
} __SQI1XCON3bits_t;
extern volatile __SQI1XCON3bits_t SQI1XCON3bits ;//__asm__ ("SQI1XCON3") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SQI1XCON4 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned INIT2CMD1:8;
  unsigned INIT2CMD2:8;
  unsigned INIT2CMD3:8;
  unsigned INIT2TYPE:2;
  unsigned INIT2COUNT:2;
  unsigned INIT2SCHECK:1;
} __SQI1XCON4bits_t;
