HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.h
extern volatile __USBDMA6Cbits_t USBDMA6Cbits ;//__asm__ ("USBDMA6C") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        USBDMA6A ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned DMAADDR:32;
} __USBDMA6Abits_t;
extern volatile __USBDMA6Abits_t USBDMA6Abits ;//__asm__ ("USBDMA6A") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        USBDMA6N ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned DMACOUNT:32;
} __USBDMA6Nbits_t;
extern volatile __USBDMA6Nbits_t USBDMA6Nbits ;//__asm__ ("USBDMA6N") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        USBDMA7C ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned DMAEN:1;
  unsigned DMADIR:1;
  unsigned DMAMODE:1;
  unsigned DMAIE:1;
  unsigned DMAEP:4;
  unsigned DMAERR:1;
  unsigned DMABRSTM:2;
} __USBDMA7Cbits_t;
extern volatile __USBDMA7Cbits_t USBDMA7Cbits ;//__asm__ ("USBDMA7C") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        USBDMA7A ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned DMAADDR:32;
} __USBDMA7Abits_t;
extern volatile __USBDMA7Abits_t USBDMA7Abits ;//__asm__ ("USBDMA7A") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        USBDMA7N ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned DMACOUNT:32;
} __USBDMA7Nbits_t;
extern volatile __USBDMA7Nbits_t USBDMA7Nbits ;//__asm__ ("USBDMA7N") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        USBDMA8C ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned DMAEN:1;
  unsigned DMADIR:1;
  unsigned DMAMODE:1;
  unsigned DMAIE:1;
  unsigned DMAEP:4;
  unsigned DMAERR:1;
  unsigned DMABRSTM:2;
} __USBDMA8Cbits_t;
extern volatile __USBDMA8Cbits_t USBDMA8Cbits ;//__asm__ ("USBDMA8C") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        USBDMA8A ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned DMAADDR:32;
} __USBDMA8Abits_t;
extern volatile __USBDMA8Abits_t USBDMA8Abits ;//__asm__ ("USBDMA8A") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        USBDMA8N ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned DMACOUNT:32;
} __USBDMA8Nbits_t;
extern volatile __USBDMA8Nbits_t USBDMA8Nbits ;//__asm__ ("USBDMA8N") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        USBE1RPC ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned RQPKTCNT:16;
} __USBE1RPCbits_t;
extern volatile __USBE1RPCbits_t USBE1RPCbits ;//__asm__ ("USBE1RPC") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        USBE2RPC ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned RQPKTCNT:16;
} __USBE2RPCbits_t;
extern volatile __USBE2RPCbits_t USBE2RPCbits ;//__asm__ ("USBE2RPC") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        USBE3RPC ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned RQPKTCNT:16;
} __USBE3RPCbits_t;
extern volatile __USBE3RPCbits_t USBE3RPCbits ;//__asm__ ("USBE3RPC") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        USBE4RPC ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned RQPKTCNT:16;
} __USBE4RPCbits_t;
extern volatile __USBE4RPCbits_t USBE4RPCbits ;//__asm__ ("USBE4RPC") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        USBE5RPC ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned RQPKTCNT:16;
} __USBE5RPCbits_t;
extern volatile __USBE5RPCbits_t USBE5RPCbits ;//__asm__ ("USBE5RPC") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        USBE6RPC ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned RQPKTCNT:16;
} __USBE6RPCbits_t;
extern volatile __USBE6RPCbits_t USBE6RPCbits ;//__asm__ ("USBE6RPC") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        USBE7RPC ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned RQPKTCNT:16;
} __USBE7RPCbits_t;
extern volatile __USBE7RPCbits_t USBE7RPCbits ;//__asm__ ("USBE7RPC") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        USBDPBFD ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned EP1RXD:1;
  unsigned EP2RXD:1;
  unsigned EP3RXD:1;
  unsigned EP4RXD:1;
  unsigned EP5RXD:1;
  unsigned EP6RXD:1;
  unsigned EP7RXD:1;
  unsigned :9;
  unsigned EP1TXD:1;
  unsigned EP2TXD:1;
  unsigned EP3TXD:1;
  unsigned EP4TXD:1;
  unsigned EP5TXD:1;
  unsigned EP6TXD:1;
  unsigned EP7TXD:1;
} __USBDPBFDbits_t;
extern volatile __USBDPBFDbits_t USBDPBFDbits ;//__asm__ ("USBDPBFD") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        USBTMCON1 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned TUCH:16;
  unsigned THHSRTN:16;
} __USBTMCON1bits_t;
extern volatile __USBTMCON1bits_t USBTMCON1bits ;//__asm__ ("USBTMCON1") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        USBTMCON2 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned THSBT:4;
} __USBTMCON2bits_t;
extern volatile __USBTMCON2bits_t USBTMCON2bits ;//__asm__ ("USBTMCON2") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        USBLPMR1 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned LNKSTATE:4;
  unsigned HIRD:4;
  unsigned RMTWAK:1;
  unsigned :3;
  unsigned ENDPOINT:4;
  unsigned LPMXMT:1;
  unsigned LPMRES:1;
  unsigned LPMEN:2;
  unsigned LPMNAK:1;
  unsigned :3;
  unsigned LPMTOIE:1;
  unsigned LPMSTIE:1;
  unsigned LPMNYIE:1;
  unsigned LPMACKIE:1;
  unsigned LPMRESIE:1;
  unsigned LPMERRIE:1;
} __USBLPMR1bits_t;
extern volatile __USBLPMR1bits_t USBLPMR1bits ;//__asm__ ("USBLPMR1") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        USBLMPR2 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned LPMST:1;
  unsigned LPMNY:1;
  unsigned LPMACK:1;
  unsigned LPMNC:1;
  unsigned LPMRES:1;
  unsigned LPMERR:1;
  unsigned :2;
  unsigned LPMFADDR:7;
} __USBLMPR2bits_t;
