HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.h
extern volatile __SBT3REG1bits_t SBT3REG1bits ;//__asm__ ("SBT3REG1") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT3RD1 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT3RD1bits_t;
extern volatile __SBT3RD1bits_t SBT3RD1bits ;//__asm__ ("SBT3RD1") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT3WR1 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT3WR1bits_t;
extern volatile __SBT3WR1bits_t SBT3WR1bits ;//__asm__ ("SBT3WR1") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT3REG2 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :3;
  unsigned SIZE:5;
  unsigned :1;
  unsigned PRI:1;
  unsigned BASE:22;
} __SBT3REG2bits_t;
extern volatile __SBT3REG2bits_t SBT3REG2bits ;//__asm__ ("SBT3REG2") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT3RD2 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT3RD2bits_t;
extern volatile __SBT3RD2bits_t SBT3RD2bits ;//__asm__ ("SBT3RD2") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT3WR2 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT3WR2bits_t;
extern volatile __SBT3WR2bits_t SBT3WR2bits ;//__asm__ ("SBT3WR2") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT4ELOG1 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CMD:3;
  unsigned :1;
  unsigned REGION:4;
  unsigned INITID:8;
  unsigned :8;
  unsigned CODE:4;
  unsigned :3;
  unsigned MULTI:1;
} __SBT4ELOG1bits_t;
extern volatile __SBT4ELOG1bits_t SBT4ELOG1bits ;//__asm__ ("SBT4ELOG1") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT4ELOG2 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned GROUP:2;
} __SBT4ELOG2bits_t;
extern volatile __SBT4ELOG2bits_t SBT4ELOG2bits ;//__asm__ ("SBT4ELOG2") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT4ECON ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :24;
  unsigned ERRP:1;
} __SBT4ECONbits_t;
extern volatile __SBT4ECONbits_t SBT4ECONbits ;//__asm__ ("SBT4ECON") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT4ECLRS ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CLEAR:1;
} __SBT4ECLRSbits_t;
extern volatile __SBT4ECLRSbits_t SBT4ECLRSbits ;//__asm__ ("SBT4ECLRS") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT4ECLRM ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CLEAR:1;
} __SBT4ECLRMbits_t;
extern volatile __SBT4ECLRMbits_t SBT4ECLRMbits ;//__asm__ ("SBT4ECLRM") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT4REG0 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :3;
  unsigned SIZE:5;
  unsigned :1;
  unsigned PRI:1;
  unsigned BASE:22;
} __SBT4REG0bits_t;
extern volatile __SBT4REG0bits_t SBT4REG0bits ;//__asm__ ("SBT4REG0") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT4RD0 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT4RD0bits_t;
extern volatile __SBT4RD0bits_t SBT4RD0bits ;//__asm__ ("SBT4RD0") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT4WR0 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT4WR0bits_t;
extern volatile __SBT4WR0bits_t SBT4WR0bits ;//__asm__ ("SBT4WR0") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT4REG2 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :3;
  unsigned SIZE:5;
  unsigned :1;
  unsigned PRI:1;
  unsigned BASE:22;
} __SBT4REG2bits_t;
extern volatile __SBT4REG2bits_t SBT4REG2bits ;//__asm__ ("SBT4REG2") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT4RD2 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT4RD2bits_t;
extern volatile __SBT4RD2bits_t SBT4RD2bits ;//__asm__ ("SBT4RD2") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT4WR2 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT4WR2bits_t;
extern volatile __SBT4WR2bits_t SBT4WR2bits ;//__asm__ ("SBT4WR2") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT5ELOG1 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CMD:3;
  unsigned :1;
  unsigned REGION:4;
  unsigned INITID:8;
  unsigned :8;
  unsigned CODE:4;
  unsigned :3;
  unsigned MULTI:1;
} __SBT5ELOG1bits_t;
extern volatile __SBT5ELOG1bits_t SBT5ELOG1bits ;//__asm__ ("SBT5ELOG1") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT5ELOG2 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned GROUP:2;
} __SBT5ELOG2bits_t;
extern volatile __SBT5ELOG2bits_t SBT5ELOG2bits ;//__asm__ ("SBT5ELOG2") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT5ECON ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :24;
  unsigned ERRP:1;
} __SBT5ECONbits_t;
extern volatile __SBT5ECONbits_t SBT5ECONbits ;//__asm__ ("SBT5ECON") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT5ECLRS ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CLEAR:1;
} __SBT5ECLRSbits_t;
extern volatile __SBT5ECLRSbits_t SBT5ECLRSbits ;//__asm__ ("SBT5ECLRS") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT5ECLRM ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CLEAR:1;
} __SBT5ECLRMbits_t;
extern volatile __SBT5ECLRMbits_t SBT5ECLRMbits ;//__asm__ ("SBT5ECLRM") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT5REG0 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :3;
  unsigned SIZE:5;
  unsigned :1;
  unsigned PRI:1;
  unsigned BASE:22;
} __SBT5REG0bits_t;
extern volatile __SBT5REG0bits_t SBT5REG0bits ;//__asm__ ("SBT5REG0") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT5RD0 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT5RD0bits_t;
extern volatile __SBT5RD0bits_t SBT5RD0bits ;//__asm__ ("SBT5RD0") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT5WR0 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT5WR0bits_t;
extern volatile __SBT5WR0bits_t SBT5WR0bits ;//__asm__ ("SBT5WR0") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT5REG1 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :3;
  unsigned SIZE:5;
  unsigned :1;
  unsigned PRI:1;
  unsigned BASE:22;
} __SBT5REG1bits_t;
extern volatile __SBT5REG1bits_t SBT5REG1bits ;//__asm__ ("SBT5REG1") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT5RD1 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT5RD1bits_t;
extern volatile __SBT5RD1bits_t SBT5RD1bits ;//__asm__ ("SBT5RD1") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT5WR1 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT5WR1bits_t;
extern volatile __SBT5WR1bits_t SBT5WR1bits ;//__asm__ ("SBT5WR1") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT5REG2 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :3;
  unsigned SIZE:5;
  unsigned :1;
  unsigned PRI:1;
  unsigned BASE:22;
} __SBT5REG2bits_t;
extern volatile __SBT5REG2bits_t SBT5REG2bits ;//__asm__ ("SBT5REG2") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT5RD2 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT5RD2bits_t;
extern volatile __SBT5RD2bits_t SBT5RD2bits ;//__asm__ ("SBT5RD2") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT5WR2 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT5WR2bits_t;
extern volatile __SBT5WR2bits_t SBT5WR2bits ;//__asm__ ("SBT5WR2") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT6ELOG1 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CMD:3;
  unsigned :1;
  unsigned REGION:4;
  unsigned INITID:8;
  unsigned :8;
  unsigned CODE:4;
  unsigned :3;
  unsigned MULTI:1;
} __SBT6ELOG1bits_t;
extern volatile __SBT6ELOG1bits_t SBT6ELOG1bits ;//__asm__ ("SBT6ELOG1") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT6ELOG2 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned GROUP:2;
} __SBT6ELOG2bits_t;
extern volatile __SBT6ELOG2bits_t SBT6ELOG2bits ;//__asm__ ("SBT6ELOG2") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT6ECON ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :24;
  unsigned ERRP:1;
} __SBT6ECONbits_t;
