HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.h
extern volatile __SBT6ECONbits_t SBT6ECONbits ;//__asm__ ("SBT6ECON") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT6ECLRS ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CLEAR:1;
} __SBT6ECLRSbits_t;
extern volatile __SBT6ECLRSbits_t SBT6ECLRSbits ;//__asm__ ("SBT6ECLRS") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT6ECLRM ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CLEAR:1;
} __SBT6ECLRMbits_t;
extern volatile __SBT6ECLRMbits_t SBT6ECLRMbits ;//__asm__ ("SBT6ECLRM") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT6REG0 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :3;
  unsigned SIZE:5;
  unsigned :1;
  unsigned PRI:1;
  unsigned BASE:22;
} __SBT6REG0bits_t;
extern volatile __SBT6REG0bits_t SBT6REG0bits ;//__asm__ ("SBT6REG0") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT6RD0 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT6RD0bits_t;
extern volatile __SBT6RD0bits_t SBT6RD0bits ;//__asm__ ("SBT6RD0") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT6WR0 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT6WR0bits_t;
extern volatile __SBT6WR0bits_t SBT6WR0bits ;//__asm__ ("SBT6WR0") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT6REG1 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :3;
  unsigned SIZE:5;
  unsigned :1;
  unsigned PRI:1;
  unsigned BASE:22;
} __SBT6REG1bits_t;
extern volatile __SBT6REG1bits_t SBT6REG1bits ;//__asm__ ("SBT6REG1") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT6RD1 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT6RD1bits_t;
extern volatile __SBT6RD1bits_t SBT6RD1bits ;//__asm__ ("SBT6RD1") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT6WR1 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT6WR1bits_t;
extern volatile __SBT6WR1bits_t SBT6WR1bits ;//__asm__ ("SBT6WR1") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT7ELOG1 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CMD:3;
  unsigned :1;
  unsigned REGION:4;
  unsigned INITID:8;
  unsigned :8;
  unsigned CODE:4;
  unsigned :3;
  unsigned MULTI:1;
} __SBT7ELOG1bits_t;
extern volatile __SBT7ELOG1bits_t SBT7ELOG1bits ;//__asm__ ("SBT7ELOG1") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT7ELOG2 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned GROUP:2;
} __SBT7ELOG2bits_t;
extern volatile __SBT7ELOG2bits_t SBT7ELOG2bits ;//__asm__ ("SBT7ELOG2") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT7ECON ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :24;
  unsigned ERRP:1;
} __SBT7ECONbits_t;
extern volatile __SBT7ECONbits_t SBT7ECONbits ;//__asm__ ("SBT7ECON") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT7ECLRS ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CLEAR:1;
} __SBT7ECLRSbits_t;
extern volatile __SBT7ECLRSbits_t SBT7ECLRSbits ;//__asm__ ("SBT7ECLRS") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT7ECLRM ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CLEAR:1;
} __SBT7ECLRMbits_t;
extern volatile __SBT7ECLRMbits_t SBT7ECLRMbits ;//__asm__ ("SBT7ECLRM") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT7REG0 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :3;
  unsigned SIZE:5;
  unsigned :1;
  unsigned PRI:1;
  unsigned BASE:22;
} __SBT7REG0bits_t;
extern volatile __SBT7REG0bits_t SBT7REG0bits ;//__asm__ ("SBT7REG0") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT7RD0 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT7RD0bits_t;
extern volatile __SBT7RD0bits_t SBT7RD0bits ;//__asm__ ("SBT7RD0") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT7WR0 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT7WR0bits_t;
extern volatile __SBT7WR0bits_t SBT7WR0bits ;//__asm__ ("SBT7WR0") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT7REG1 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :3;
  unsigned SIZE:5;
  unsigned :1;
  unsigned PRI:1;
  unsigned BASE:22;
} __SBT7REG1bits_t;
extern volatile __SBT7REG1bits_t SBT7REG1bits ;//__asm__ ("SBT7REG1") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT7RD1 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT7RD1bits_t;
extern volatile __SBT7RD1bits_t SBT7RD1bits ;//__asm__ ("SBT7RD1") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT7WR1 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT7WR1bits_t;
extern volatile __SBT7WR1bits_t SBT7WR1bits ;//__asm__ ("SBT7WR1") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT8ELOG1 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CMD:3;
  unsigned :1;
  unsigned REGION:4;
  unsigned INITID:8;
  unsigned :8;
  unsigned CODE:4;
  unsigned :3;
  unsigned MULTI:1;
} __SBT8ELOG1bits_t;
extern volatile __SBT8ELOG1bits_t SBT8ELOG1bits ;//__asm__ ("SBT8ELOG1") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT8ELOG2 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned GROUP:2;
} __SBT8ELOG2bits_t;
extern volatile __SBT8ELOG2bits_t SBT8ELOG2bits ;//__asm__ ("SBT8ELOG2") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT8ECON ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :24;
  unsigned ERRP:1;
} __SBT8ECONbits_t;
extern volatile __SBT8ECONbits_t SBT8ECONbits ;//__asm__ ("SBT8ECON") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT8ECLRS ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CLEAR:1;
} __SBT8ECLRSbits_t;
extern volatile __SBT8ECLRSbits_t SBT8ECLRSbits ;//__asm__ ("SBT8ECLRS") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT8ECLRM ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CLEAR:1;
} __SBT8ECLRMbits_t;
extern volatile __SBT8ECLRMbits_t SBT8ECLRMbits ;//__asm__ ("SBT8ECLRM") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT8REG0 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :3;
  unsigned SIZE:5;
  unsigned :1;
  unsigned PRI:1;
  unsigned BASE:22;
} __SBT8REG0bits_t;
extern volatile __SBT8REG0bits_t SBT8REG0bits ;//__asm__ ("SBT8REG0") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT8RD0 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT8RD0bits_t;
extern volatile __SBT8RD0bits_t SBT8RD0bits ;//__asm__ ("SBT8RD0") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT8WR0 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT8WR0bits_t;
