HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.h
extern volatile __SBT8WR0bits_t SBT8WR0bits ;//__asm__ ("SBT8WR0") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT8REG1 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :3;
  unsigned SIZE:5;
  unsigned :1;
  unsigned PRI:1;
  unsigned BASE:22;
} __SBT8REG1bits_t;
extern volatile __SBT8REG1bits_t SBT8REG1bits ;//__asm__ ("SBT8REG1") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT8RD1 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT8RD1bits_t;
extern volatile __SBT8RD1bits_t SBT8RD1bits ;//__asm__ ("SBT8RD1") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT8WR1 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT8WR1bits_t;
extern volatile __SBT8WR1bits_t SBT8WR1bits ;//__asm__ ("SBT8WR1") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT9ELOG1 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CMD:3;
  unsigned :1;
  unsigned REGION:4;
  unsigned INITID:8;
  unsigned :8;
  unsigned CODE:4;
  unsigned :3;
  unsigned MULTI:1;
} __SBT9ELOG1bits_t;
extern volatile __SBT9ELOG1bits_t SBT9ELOG1bits ;//__asm__ ("SBT9ELOG1") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT9ELOG2 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned GROUP:2;
} __SBT9ELOG2bits_t;
extern volatile __SBT9ELOG2bits_t SBT9ELOG2bits ;//__asm__ ("SBT9ELOG2") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT9ECON ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :24;
  unsigned ERRP:1;
} __SBT9ECONbits_t;
extern volatile __SBT9ECONbits_t SBT9ECONbits ;//__asm__ ("SBT9ECON") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT9ECLRS ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CLEAR:1;
} __SBT9ECLRSbits_t;
extern volatile __SBT9ECLRSbits_t SBT9ECLRSbits ;//__asm__ ("SBT9ECLRS") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT9ECLRM ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CLEAR:1;
} __SBT9ECLRMbits_t;
extern volatile __SBT9ECLRMbits_t SBT9ECLRMbits ;//__asm__ ("SBT9ECLRM") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT9REG0 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :3;
  unsigned SIZE:5;
  unsigned :1;
  unsigned PRI:1;
  unsigned BASE:22;
} __SBT9REG0bits_t;
extern volatile __SBT9REG0bits_t SBT9REG0bits ;//__asm__ ("SBT9REG0") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT9RD0 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT9RD0bits_t;
extern volatile __SBT9RD0bits_t SBT9RD0bits ;//__asm__ ("SBT9RD0") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT9WR0 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT9WR0bits_t;
extern volatile __SBT9WR0bits_t SBT9WR0bits ;//__asm__ ("SBT9WR0") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT9REG1 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :3;
  unsigned SIZE:5;
  unsigned :1;
  unsigned PRI:1;
  unsigned BASE:22;
} __SBT9REG1bits_t;
extern volatile __SBT9REG1bits_t SBT9REG1bits ;//__asm__ ("SBT9REG1") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT9RD1 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT9RD1bits_t;
extern volatile __SBT9RD1bits_t SBT9RD1bits ;//__asm__ ("SBT9RD1") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT9WR1 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT9WR1bits_t;
extern volatile __SBT9WR1bits_t SBT9WR1bits ;//__asm__ ("SBT9WR1") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT10ELOG1 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CMD:3;
  unsigned :1;
  unsigned REGION:4;
  unsigned INITID:8;
  unsigned :8;
  unsigned CODE:4;
  unsigned :3;
  unsigned MULTI:1;
} __SBT10ELOG1bits_t;
extern volatile __SBT10ELOG1bits_t SBT10ELOG1bits ;//__asm__ ("SBT10ELOG1") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT10ELOG2 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned GROUP:2;
} __SBT10ELOG2bits_t;
extern volatile __SBT10ELOG2bits_t SBT10ELOG2bits ;//__asm__ ("SBT10ELOG2") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT10ECON ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :24;
  unsigned ERRP:1;
} __SBT10ECONbits_t;
extern volatile __SBT10ECONbits_t SBT10ECONbits ;//__asm__ ("SBT10ECON") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT10ECLRS ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CLEAR:1;
} __SBT10ECLRSbits_t;
extern volatile __SBT10ECLRSbits_t SBT10ECLRSbits ;//__asm__ ("SBT10ECLRS") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT10ECLRM ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CLEAR:1;
} __SBT10ECLRMbits_t;
extern volatile __SBT10ECLRMbits_t SBT10ECLRMbits ;//__asm__ ("SBT10ECLRM") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT10REG0 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :3;
  unsigned SIZE:5;
  unsigned :1;
  unsigned PRI:1;
  unsigned BASE:22;
} __SBT10REG0bits_t;
extern volatile __SBT10REG0bits_t SBT10REG0bits ;//__asm__ ("SBT10REG0") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT10RD0 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT10RD0bits_t;
extern volatile __SBT10RD0bits_t SBT10RD0bits ;//__asm__ ("SBT10RD0") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT10WR0 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT10WR0bits_t;
extern volatile __SBT10WR0bits_t SBT10WR0bits ;//__asm__ ("SBT10WR0") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT11ELOG1 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CMD:3;
  unsigned :1;
  unsigned REGION:4;
  unsigned INITID:8;
  unsigned :8;
  unsigned CODE:4;
  unsigned :3;
  unsigned MULTI:1;
} __SBT11ELOG1bits_t;
extern volatile __SBT11ELOG1bits_t SBT11ELOG1bits ;//__asm__ ("SBT11ELOG1") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT11ELOG2 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned GROUP:2;
} __SBT11ELOG2bits_t;
extern volatile __SBT11ELOG2bits_t SBT11ELOG2bits ;//__asm__ ("SBT11ELOG2") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT11ECON ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :24;
  unsigned ERRP:1;
} __SBT11ECONbits_t;
extern volatile __SBT11ECONbits_t SBT11ECONbits ;//__asm__ ("SBT11ECON") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT11ECLRS ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CLEAR:1;
} __SBT11ECLRSbits_t;
extern volatile __SBT11ECLRSbits_t SBT11ECLRSbits ;//__asm__ ("SBT11ECLRS") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT11ECLRM ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned CLEAR:1;
} __SBT11ECLRMbits_t;
extern volatile __SBT11ECLRMbits_t SBT11ECLRMbits ;//__asm__ ("SBT11ECLRM") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT11REG0 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :3;
  unsigned SIZE:5;
  unsigned :1;
  unsigned PRI:1;
  unsigned BASE:22;
} __SBT11REG0bits_t;
extern volatile __SBT11REG0bits_t SBT11REG0bits ;//__asm__ ("SBT11REG0") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT11RD0 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT11RD0bits_t;
extern volatile __SBT11RD0bits_t SBT11RD0bits ;//__asm__ ("SBT11RD0") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT11WR0 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT11WR0bits_t;
extern volatile __SBT11WR0bits_t SBT11WR0bits ;//__asm__ ("SBT11WR0") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT11REG1 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned :3;
  unsigned SIZE:5;
  unsigned :1;
  unsigned PRI:1;
  unsigned BASE:22;
} __SBT11REG1bits_t;
extern volatile __SBT11REG1bits_t SBT11REG1bits ;//__asm__ ("SBT11REG1") ;//__attribute__((section("sfrs")));
extern volatile unsigned int        SBT11RD1 ;//__attribute__((section("sfrs")));
typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT11RD1bits_t;
